[{"appid": 730, "name": "Counter-Strike: Global Offensive", "release_date": "2012-08-21", "developer": "Valve;Hidden Path Entertainment", "platforms": "windows;mac;linux", "short_description": "Counter-Strike: Global Offensive (CS: GO) expands upon the team-based action gameplay that it pioneered when it was launched 19 years ago. CS: GO features new maps, characters, weapons, and game modes, and delivers updated versions of the classic CS content (de_dust2, etc.)."}, {"appid": 578080, "name": "PLAYERUNKNOWN'S BATTLEGROUNDS", "release_date": "2017-12-21", "developer": "PUBG Corporation", "platforms": "windows", "short_description": "PLAYERUNKNOWN'S BATTLEGROUNDS is a battle royale shooter that pits 100 players against each other in a struggle for survival. Gather supplies and outwit your opponents to become the last person standing."}, {"appid": 10180, "name": "Call of Duty®: Modern Warfare® 2", "release_date": "2009-11-11", "developer": "Infinity Ward;Aspyr (Mac)", "platforms": "windows;mac", "short_description": "The most-anticipated game of the year and the sequel to the best-selling first-person action game of all time, Modern Warfare 2 continues the gripping and heart-racing action as players face off against a new threat dedicated to bringing the world to the brink of collapse."}, {"appid": 278360, "name": "A Story About My Uncle", "release_date": "2014-05-28", "developer": "Gone North Games", "platforms": "windows;mac;linux", "short_description": "A Story About My Uncle is a first person platforming adventure game about a boy who searches for his lost uncle, and ends up in a world he couldn’t imagine existed. The movement is a crucial part of the games core gameplay – focusing on swinging through the world with a grappling hook that gives the player a wonderful sense of speed and..."}, {"appid": 49520, "name": "Borderlands 2", "release_date": "2012-09-20", "developer": "Gearbox Software;Aspyr (Mac);Aspyr (Linux)", "platforms": "windows;mac;linux", "short_description": "The Ultimate Vault Hunter’s Upgrade lets you get the most out of the Borderlands 2 experience."}, {"appid": 227300, "name": "Euro Truck Simulator 2", "release_date": "2012-10-12", "developer": "SCS Software", "platforms": "windows;mac;linux", "short_description": "Travel across Europe as king of the road, a trucker who delivers important cargo across impressive distances! With dozens of cities to explore from the UK, Belgium, Germany, Italy, the Netherlands, Poland, and many more, your endurance, skill and speed will all be pushed to their limits."}, {"appid": 550650, "name": "Black Squad", "release_date": "2017-07-28", "developer": "NS STUDIO", "platforms": "windows", "short_description": "Black Squad is a free-to-play military first-person-shooter. Players can master their skills and show off their strategies with a wide range of game maps, modes, and weapons to choose from. Join thousands of FPS players worldwide in one of the most played games on Steam!"}, {"appid": 224260, "name": "No More Room in Hell", "release_date": "2013-10-31", "developer": "No More Room in Hell Team", "platforms": "windows;mac;linux", "short_description": "&quot;When there's no more room in hell, the dead will walk the earth.&quot;A tribute to the highly acclaimed film series in which the above quote originated from, No More Room in Hell (PC Gamer's Mod of the Year 2011, ModDB's Editor Choice Multiplayer Mod of the Year 2011), is a co-operative realistic first person survival horror..."}, {"appid": 292030, "name": "The Witcher® 3: Wild Hunt", "release_date": "2015-05-18", "developer": "CD PROJEKT RED", "platforms": "windows", "short_description": "As war rages on throughout the Northern Realms, you take on the greatest contract of your life — tracking down the Child of Prophecy, a living weapon that can alter the shape of the world."}, {"appid": 273110, "name": "Counter-Strike Nexon: Zombies", "release_date": "2014-10-07", "developer": "Valve Corporation, Nexon Korea Corporation", "platforms": "windows", "short_description": "Counter-Strike Nexon: Zombies is a Free to Play MMOFPS offering competitive PvP and PvE action including content from the original Counter-Strike and all new game modes, maps, weapons, and hordes of Zombies!"}, {"appid": 113400, "name": "APB Reloaded", "release_date": "2011-12-06", "developer": "Little Orbit", "platforms": "windows", "short_description": "The world’s first and premier Action MMO Third Person Shooter allows you to choose between two sides of the law. Play as Enforcer or Criminal, customize your gear for the task at hand and hit the streets and play how you want in a city filled with more action this side of a Hollywood blockbuster."}, {"appid": 333930, "name": "Dirty Bomb®", "release_date": "2015-06-01", "developer": "Splash Damage", "platforms": "windows", "short_description": "Work together or die alone! Fight to restore peace to London or tear it down for profit in the most challenging team based shooter around."}, {"appid": 253710, "name": "theHunter Classic", "release_date": "2014-06-03", "developer": "Expansive Worlds;Avalanche Studios", "platforms": "windows", "short_description": "The most realistic hunting experience awaits. Explore 11 reserves and hunt 39 unique species, ranging from waterfowl to big game. Over 80 weapons from state-of-the art rifles to bows. Customize your load-out with stands, blinds and dogs. Play alone or in multiplayer with up to 7 friends."}, {"appid": 105600, "name": "Terraria", "release_date": "2011-05-16", "developer": "Re-Logic", "platforms": "windows;mac;linux", "short_description": "Dig, fight, explore, build! Nothing is impossible in this action-packed adventure game. Four Pack also available!"}, {"appid": 346110, "name": "ARK: Survival Evolved", "release_date": "2017-08-27", "developer": "Studio Wildcard;Instinct Games;Efecto Studios;Virtual Basement LLC", "platforms": "windows;mac;linux", "short_description": "Stranded on the shores of a mysterious island, you must learn to survive. Use your cunning to kill or tame the primeval creatures roaming the land, and encounter other players to survive, dominate... and escape!"}, {"appid": 431960, "name": "Wallpaper Engine", "release_date": "2018-11-16", "developer": "Kristjan Skutta", "platforms": "windows", "short_description": "Use stunning live wallpapers on your desktop. Animate your own images to create new wallpapers or import videos/websites and share them on Steam Workshop!"}, {"appid": 219640, "name": "Chivalry: Medieval Warfare", "release_date": "2012-10-16", "developer": "Torn Banner Studios", "platforms": "windows;mac;linux", "short_description": "Besiege castles and raid villages in Chivalry: Medieval Warfare, a fast-paced medieval first person slasher with a focus on multiplayer battles"}, {"appid": 322330, "name": "Don't Starve Together", "release_date": "2016-04-21", "developer": "Klei Entertainment", "platforms": "windows;mac;linux", "short_description": "Don't Starve Together is the standalone multiplayer expansion of the uncompromising survival game Don't Starve."}, {"appid": 20, "name": "Team Fortress Classic", "release_date": "1999-04-01", "developer": "Valve", "platforms": "windows;mac;linux", "short_description": "One of the most popular online action games of all time, Team Fortress Classic features over nine character classes -- from Medic to Spy to Demolition Man -- enlisted in a unique style of online team warfare. Each character class possesses unique weapons, items, and abilities, as teams compete online in a variety of game play modes."}, {"appid": 386360, "name": "SMITE®", "release_date": "2015-09-08", "developer": "Titan Forge Games", "platforms": "windows", "short_description": "Join over 30 million SMITE players! Wield Thor’s hammer, transform your foes to stone as Medusa, or choose from the other 100+ mythological icons. You’ll always have more to discover with free updates every two weeks. Enter the Battleground of the Gods!"}, {"appid": 203160, "name": "Tomb Raider", "release_date": "2013-03-04", "developer": "Crystal Dynamics;Eidos-Montréal;Feral Interactive (Mac);Feral Interactive (Linux)", "platforms": "windows;mac;linux", "short_description": "Tomb Raider explores the intense origin story of Lara Croft and her ascent from a young woman to a hardened survivor."}, {"appid": 8930, "name": "Sid Meier's Civilization® V", "release_date": "2010-09-23", "developer": "Firaxis Games;Aspyr (Mac);Aspyr (Linux)", "platforms": "windows;mac;linux", "short_description": "Create, discover, and download new player-created maps, scenarios, interfaces, and more!"}, {"appid": 319630, "name": "Life is Strange - Episode 1", "release_date": "2015-01-29", "developer": "DONTNOD Entertainment;Feral Interactive (Mac);Feral Interactive (Linux)", "platforms": "windows;mac;linux", "short_description": "Episode 1 now FREE! Life is Strange is an award-winning and critically acclaimed episodic adventure game that allows the player to rewind time and affect the past, present and future."}, {"appid": 252950, "name": "Rocket League®", "release_date": "2015-07-07", "developer": "Psyonix, Inc.", "platforms": "windows;mac;linux", "short_description": "Rocket League is a high-powered hybrid of arcade-style soccer and vehicular mayhem with easy-to-understand controls and fluid, physics-driven competition. Rocket League includes casual and competitive Online Matches, a fully-featured offline Season Mode, special “Mutators” that let you change the rules entirely, hockey and..."}, {"appid": 252490, "name": "Rust", "release_date": "2018-02-08", "developer": "Facepunch Studios", "platforms": "windows;mac", "short_description": "The only aim in Rust is to survive. To do this you will need to overcome struggles such as hunger, thirst and cold. Build a fire. Build a shelter. Kill animals for meat. Protect yourself from other players, and kill them for meat. Create alliances with other players and form a town. Do whatever it takes to survive."}, {"appid": 363970, "name": "Clicker Heroes", "release_date": "2015-05-13", "developer": "Playsaurus", "platforms": "windows;mac", "short_description": "Ever wondered what one quadrillion damage per second feels like? Wonder no more! Embark on your quest to attain it today! Start out by clicking on the monster to kill them, and get their gold. Spend that gold on hiring new heroes and get more damage. The more damage you deal, the more gold you will get."}, {"appid": 221380, "name": "Age of Empires II HD", "release_date": "2013-04-09", "developer": "Skybox Labs;Hidden Path Entertainment;Ensemble Studios;Forgotten Empires", "platforms": "windows", "short_description": "Age of Empires II has been re-imagined in high definition with new features, trading cards, improved AI, workshop support, multiplayer, Steamworks integration and more!"}, {"appid": 109600, "name": "Neverwinter", "release_date": "2013-12-05", "developer": "Cryptic Studios", "platforms": "windows", "short_description": "Neverwinter is a free, action MMORPG based on the acclaimed Dungeons &amp; Dragons fantasy roleplaying game. Epic stories, action combat and classic roleplaying await those heroes courageous enough to enter the fantastic world of Neverwinter!"}, {"appid": 381210, "name": "Dead by Daylight", "release_date": "2016-06-14", "developer": "Behaviour Digital Inc.", "platforms": "windows", "short_description": "Dead by Daylight is a multiplayer (4vs1) horror game where one player takes on the role of the savage Killer, and the other four players play as Survivors, trying to escape the Killer and avoid being caught and killed."}, {"appid": 304050, "name": "Trove", "release_date": "2015-07-09", "developer": "Trion Worlds", "platforms": "windows;mac", "short_description": "Grab your friends, hone your blades, and set off for adventure in Trove, the ultimate action MMO!"}, {"appid": 582010, "name": "MONSTER HUNTER: WORLD", "release_date": "2018-08-09", "developer": "CAPCOM Co., Ltd.", "platforms": "windows", "short_description": "Welcome to a new world! In Monster Hunter: World, the latest installment in the series, you can enjoy the ultimate hunting experience, using everything at your disposal to hunt monsters in a new world teeming with surprises and excitement."}, {"appid": 360, "name": "Half-Life Deathmatch: Source", "release_date": "2006-05-01", "developer": "Valve", "platforms": "windows;mac;linux", "short_description": "Half-Life Deathmatch: Source is a recreation of the first multiplayer game set in the Half-Life universe. Features all the classic weapons and most-played maps, now running on the Source engine."}, {"appid": 420, "name": "Half-Life 2: Episode Two", "release_date": "2007-10-10", "developer": "Valve", "platforms": "windows;mac;linux", "short_description": "Half-Life&reg; 2: Episode Two is the second in a trilogy of new games created by Valve that extends the award-winning and best-selling Half-Life&reg; adventure. As Dr. Gordon Freeman, you were last seen exiting City 17 with Alyx Vance as the Citadel erupted amidst a storm of unknown proportions."}, {"appid": 300, "name": "Day of Defeat: Source", "release_date": "2010-07-12", "developer": "Valve", "platforms": "windows;mac;linux", "short_description": "Valve's WWII Multiplayer Classic - Now available for Mac."}, {"appid": 218230, "name": "PlanetSide 2", "release_date": "2012-11-20", "developer": "Daybreak Game Company", "platforms": "windows", "short_description": "PlanetSide 2 is an all-out planetary war, where thousands of players battle as one across enormous continents. Utilize infantry, ground and air vehicles, and teamwork to destroy your enemies in this revolutionary first-person shooter on a massive scale."}, {"appid": 555570, "name": "Infestation: The New Z", "release_date": "2016-11-22", "developer": "Fredaikis AB", "platforms": "windows", "short_description": "The New Z is a FREE TO PLAY multi-game mode experience. Play BATTLE ROYALE and be the last man standing to win. SURVIVE with friends and gather loot, stash and trade. Go into wars against other groups in a massive OPEN WORLD. Three different separate game modes ALL IN ONE GAME."}, {"appid": 500, "name": "Left 4 Dead", "release_date": "2008-11-17", "developer": "Valve", "platforms": "windows;mac", "short_description": "From Valve (the creators of Counter-Strike, Half-Life and more) comes Left 4 Dead, a co-op action horror game for the PC and Xbox 360 that casts up to four players in an epic struggle for survival against swarming zombie hordes and terrifying mutant monsters."}, {"appid": 255710, "name": "Cities: Skylines", "release_date": "2015-03-10", "developer": "Colossal Order Ltd.", "platforms": "windows;mac;linux", "short_description": "Cities: Skylines is a modern take on the classic city simulation. The game introduces new game play elements to realize the thrill and hardships of creating and maintaining a real city whilst expanding on some well-established tropes of the city building experience."}, {"appid": 359550, "name": "Tom Clancy's Rainbow Six® Siege", "release_date": "2015-12-01", "developer": "Ubisoft Montreal", "platforms": "windows", "short_description": "Tom Clancy's Rainbow Six Siege is the latest installment of the acclaimed first-person shooter franchise developed by the renowned Ubisoft Montreal studio."}, {"appid": 863550, "name": "HITMAN™ 2", "release_date": "2018-11-13", "developer": "IO Interactive A/S", "platforms": "windows", "short_description": "Travel the globe and track your targets across exotic sandbox locations in HITMAN™ 2. From sun-drenched streets to dark and dangerous rainforests, nowhere is safe from the world’s most creative assassin, Agent 47 in the ultimate spy thriller story."}, {"appid": 377160, "name": "Fallout 4", "release_date": "2015-11-09", "developer": "Bethesda Game Studios", "platforms": "windows", "short_description": "Bethesda Game Studios, the award-winning creators of Fallout 3 and The Elder Scrolls V: Skyrim, welcome you to the world of Fallout 4 – their most ambitious game ever, and the next generation of open-world gaming."}, {"appid": 130, "name": "Half-Life: Blue Shift", "release_date": "2001-06-01", "developer": "Gearbox Software", "platforms": "windows;mac;linux", "short_description": "Made by Gearbox Software and originally released in 2001 as an add-on to Half-Life, Blue Shift is a return to the Black Mesa Research Facility in which you play as Barney Calhoun, the security guard sidekick who helped Gordon out of so many sticky situations."}, {"appid": 70, "name": "Half-Life", "release_date": "1998-11-08", "developer": "Valve", "platforms": "windows;mac;linux", "short_description": "Named Game of the Year by over 50 publications, Valve's debut title blends action and adventure with award-winning technology to create a frighteningly realistic world where players must think to survive. Also includes an exciting multiplayer mode that allows you to play against friends and enemies around the world."}, {"appid": 60, "name": "Ricochet", "release_date": "2000-11-01", "developer": "Valve", "platforms": "windows;mac;linux", "short_description": "A futuristic action game that challenges your agility as well as your aim, Ricochet features one-on-one and team matches played in a variety of futuristic battle arenas."}, {"appid": 50, "name": "Half-Life: Opposing Force", "release_date": "1999-11-01", "developer": "Gearbox Software", "platforms": "windows;mac;linux", "short_description": "Return to the Black Mesa Research Facility as one of the military specialists assigned to eliminate Gordon Freeman. Experience an entirely new episode of single player action. Meet fierce alien opponents, and experiment with new weaponry. Named 'Game of the Year' by the Academy of Interactive Arts and Sciences."}, {"appid": 40, "name": "Deathmatch Classic", "release_date": "2001-06-01", "developer": "Valve", "platforms": "windows;mac;linux", "short_description": "Enjoy fast-paced multiplayer gaming with Deathmatch Classic (a.k.a. DMC). Valve's tribute to the work of id software, DMC invites players to grab their rocket launchers and put their reflexes to the test in a collection of futuristic settings."}, {"appid": 30, "name": "Day of Defeat", "release_date": "2003-05-01", "developer": "Valve", "platforms": "windows;mac;linux", "short_description": "Enlist in an intense brand of Axis vs. Allied teamplay set in the WWII European Theatre of Operations. Players assume the role of light/assault/heavy infantry, sniper or machine-gunner class, each with a unique arsenal of historical weaponry at their disposal. Missions are based on key historical operations."}, {"appid": 380, "name": "Half-Life 2: Episode One", "release_date": "2006-06-01", "developer": "Valve", "platforms": "windows;mac;linux", "short_description": "Half-Life 2 has sold over 4 million copies worldwide, and earned over 35 Game of the Year Awards. Episode One is the first in a series of games that reveal the aftermath of Half-Life 2 and launch a journey beyond City 17. Also features two multiplayer games. Half-Life 2 not required."}, {"appid": 24790, "name": "Command & Conquer 3: Tiberium Wars", "release_date": "2009-11-13", "developer": "EA Los Angeles", "platforms": "windows", "short_description": "The year is 2047. A massive nuclear fireball explodes high in the night sky, marking the dramatic beginning of the Third Tiberium War and the long-awaited return of the most groundbreaking Real-Time Strategy franchise of all time."}, {"appid": 25000, "name": "Overgrowth", "release_date": "2017-10-16", "developer": "Wolfire Games", "platforms": "windows;mac;linux", "short_description": "Feel like the star of a martial arts film in Overgrowth, as you jump, kick, throw, and slash your way to victory. Free the rabbits from their evil overlords in the main story, then play through the prequel story, and finally, try out nine years of mods developed by the community, or create your own!"}, {"appid": 457140, "name": "Oxygen Not Included", "release_date": "2017-05-18", "developer": "Klei Entertainment", "platforms": "windows;mac;linux", "short_description": "Oxygen Not Included is a space-colony simulation game. Deep inside an alien space rock your industrious crew will need to master science, overcome strange new lifeforms, and harness incredible space tech to survive, and possibly, thrive."}, {"appid": 242640, "name": "Styx: Master of Shadows", "release_date": "2014-10-07", "developer": "Cyanide Studio", "platforms": "windows", "short_description": "Styx: Master of Shadows is an infiltration game with RPG elements taking place in a dark fantasy universe, where you sneak, steal and assassinate your way through as Styx, a Goblin two-centuries of age."}, {"appid": 242680, "name": "Nuclear Throne", "release_date": "2015-12-05", "developer": "Vlambeer", "platforms": "windows;mac;linux", "short_description": "Nuclear Throne is a post-apocalyptic roguelike-like top-down shooter. Not 'the final hope of humanity' post-apocalyptic, but 'humanity is extinct and mutants and monsters now roam the world' post-apocalyptic. Fight your way through the wastelands with powerful weaponry, collecting radiation to mutate some new limbs and abilities."}, {"appid": 307290, "name": "Velvet Sundown", "release_date": "2014-07-22", "developer": "Tribe Studios", "platforms": "windows;mac", "short_description": "Velvet Sundown is a social multiplayer role-playing game, taking place on a luxury yacht cruising the waters of a fictitious Caribbean state of Balbonia. Embark on a journey full of conspiracies, trickery and secrets where you can never tell a friend from foe."}, {"appid": 434650, "name": "Lost Castle", "release_date": "2016-08-31", "developer": "Hunter Studio", "platforms": "windows;mac", "short_description": "Lost Castle is an action RPG beat'em up with roguelike elements and randomized dungeons for up to four players!"}, {"appid": 434570, "name": "Blood and Bacon", "release_date": "2016-02-01", "developer": "Big Corporation", "platforms": "windows", "short_description": "This Multiplayer (Up To 6P) FPS has a new Horde Mode, Day and Night levels, players will take on 25 enemy types and numerous bosses, like Gargantuan Monsters and Minibosses every 10 days as you explore, shoot and run for your life against the onslaught of porcine monstrosities."}, {"appid": 24720, "name": "SPORE™ Galactic Adventures", "release_date": "2009-06-26", "developer": "EA - Maxis", "platforms": "windows", "short_description": "Take Your Creature From Zero To Galactic Hero Get out of your starship and turn your Spore creatures into legendary Space Captains. For the first time, beam down with your allies to take on action-packed, planetside adventures."}, {"appid": 582890, "name": "Estranged: Act II", "release_date": "2017-03-17", "developer": "Alan Edwardes", "platforms": "windows;linux", "short_description": "Estranged: Act II follows the story of a fisherman, stranded on a mysterious island during a violent storm. Little does he know his adventure has just begun, and the island is home to more than it first seems."}, {"appid": 385760, "name": "NBA 2K17", "release_date": "2016-09-20", "developer": "Visual Concepts", "platforms": "windows", "short_description": "Following the record-breaking launch of NBA 2K16, the NBA 2K franchise continues to stake its claim as the most authentic sports video game with NBA 2K17. As the franchise that “all sports video games should aspire to be” (GamesRadar), NBA 2K17 will take the game to new heights and continue to blur the lines between video game and..."}, {"appid": 706990, "name": "BLOCKPOST", "release_date": "2019-04-25", "developer": "Skullcap Studios", "platforms": "windows", "short_description": "Procedural cubic 3D-shooter in the best traditions of the genre. The game is a rich cocktail consisting of the most popular and functional gaming solutions. Customization of characters, opening cases and improving the existing arsenal — all this is available in the game now."}, {"appid": 115320, "name": "Prototype 2", "release_date": "2012-07-26", "developer": "Radical Entertainment", "platforms": "windows", "short_description": "Become the ultimate shape-shifting weapon!"}, {"appid": 871720, "name": "Ultimate Custom Night", "release_date": "2018-06-27", "developer": "Scott Cawthon", "platforms": "windows", "short_description": "Welcome to the ultimate FNAF mashup, featuring 50 selectable characters and custom difficulties!"}, {"appid": 25890, "name": "Hearts of Iron III", "release_date": "2009-08-07", "developer": "Paradox Development Studio", "platforms": "windows;mac", "short_description": "Hearts of Iron III lets you play the most engaging conflict in world history, World War 2, on all fronts as any country and through multiple different scenarios. Guide your nation to glory between 1936 and 1948 and wage war, conduct diplomacy and build your industry in the most detailed World War 2 game ever made."}, {"appid": 385770, "name": "Time Clickers", "release_date": "2015-07-23", "developer": "Proton Studio Inc", "platforms": "windows;mac;linux", "short_description": "Time Clickers is what's called an 'incremental game'. There's always a fun upgrade to look forward to, and the numbers keep getting bigger! Hire a team to fight for you, even when you're offline!"}, {"appid": 410110, "name": "12 is Better Than 6", "release_date": "2015-11-20", "developer": "Ink Stains Games", "platforms": "windows;mac;linux", "short_description": "12 is Better Than 6 is a dynamic top-down shooter with stealth elements, presented in a Wild West theme. The story puts you in the shoes of escaped slave fleeing to the United States in 1873."}, {"appid": 512470, "name": "The Pirate: Caribbean Hunt", "release_date": "2016-08-24", "developer": "Home Net Games", "platforms": "windows;mac;linux", "short_description": "Hail to the Captain! Sail into the heart of the Caribbean in the Age of Piracy - the time of black flags and white skulls, blue waves and golden opportunities. Hoist the Jolly Roger and grab the steering wheel to sail through battles and raids, ransoms and treasures, to become the Crimson King of the Antilles!"}, {"appid": 385800, "name": "NEKOPARA Vol. 0", "release_date": "2015-08-17", "developer": "NEKO WORKs", "platforms": "windows", "short_description": "Please note that NEKOPARA Vol. 0 is a fandisc for NEKOPARA Vol. 1What's NEKOPARA? Why, it's a cat paradise! This is a story just before Kashou opened &quot;La Soleil&quot;.Enjoy a page from the leisurely, daily lives of Shigure and the Minaduki household's catgirls!"}, {"appid": 22600, "name": "Worms Reloaded", "release_date": "2010-08-26", "developer": "Team17 Digital Ltd", "platforms": "windows;mac;linux", "short_description": "Ten years on from Worms™ Armageddon and the turn-based comic mayhem continues in Worms™ Reloaded, an all-new edition available for PC through Steam."}, {"appid": 386070, "name": "Planetary Annihilation: TITANS", "release_date": "2015-08-18", "developer": "Planetary Annihilation Inc", "platforms": "windows;mac;linux", "short_description": "Wage war across entire solar systems with massive armies at your command. Annihilate enemy forces with world-shattering TITAN-class units, and demolish planets with massive super weapons!"}, {"appid": 111600, "name": "Serious Sam Double D XXL", "release_date": "2011-08-30", "developer": "Mommy's Best Games", "platforms": "windows", "short_description": "Pile on the firepower with the revolutionary Gunstacker and fire all your weapons at once in a symphony of destruction!"}, {"appid": 272060, "name": "Serena", "release_date": "2014-01-30", "developer": "Senscape", "platforms": "windows;mac;linux", "short_description": "How long has it been? A man sits in a distant getaway cabin waiting for his wife Serena. Where is she? Things in the cabin evoke memories, and the husband comes to a disturbing realization... This short point-and-click adventure is the result of a massive collaborative effort between dozens of fans and designers of adventure games."}, {"appid": 240760, "name": "Wasteland 2: Director's Cut", "release_date": "2014-09-18", "developer": "inXile Entertainment", "platforms": "windows;mac;linux", "short_description": "From the producer of the original Fallout comes Wasteland 2. With over 80 hours of gameplay, deck out your Ranger squad with devastating weaponry, test the limits of your strategy skills, and bring justice to the Wasteland! The choices are yours…but so are the consequences."}, {"appid": 511800, "name": "ONRAID", "release_date": "2017-04-18", "developer": "Pragmatix Ltd", "platforms": "windows;mac;linux", "short_description": "Onraid is a challenging 2D shooter game, where you are free to develop your own play style and tactics to destroy your enemies."}, {"appid": 218740, "name": "Pid", "release_date": "2012-10-31", "developer": "Might and Delight", "platforms": "windows;mac", "short_description": "Challenging platformer with striking visuals and deep engrossing story transports you to a world beyond ours!"}, {"appid": 271240, "name": "Offworld Trading Company - Free Multiplayer", "release_date": "2016-04-28", "developer": "Mohawk Games", "platforms": "windows;mac", "short_description": "Mars has been colonized, and Earth's corporate titans fight to dominate this new market. Competition is fierce in this fast-paced economic RTS from Civilization IV Lead Designer, Soren Johnson."}, {"appid": 242880, "name": "Sir, You Are Being Hunted", "release_date": "2014-05-02", "developer": "Big Robot Ltd", "platforms": "windows;mac;linux", "short_description": "Sir, You Are Being Hunted is a freedom sandbox stealth experience, where each playthrough is unique, thanks to our British Countryside Generator. Escape from these robot-infested islands with violence, trickery and stealth. This brutally funny game is available for Windows, OSX, and Linux."}, {"appid": 244160, "name": "Homeworld Remastered Collection", "release_date": "2015-02-25", "developer": "Gearbox Software;Aspyr (Mac)", "platforms": "windows;mac", "short_description": "Experience the epic space strategy games that redefined the RTS genre. Control your fleet and build an armada across more than 30 single-player missions. Choose unit types, fleet formations and flight tactics for each strategic situation."}, {"appid": 244210, "name": "Assetto Corsa", "release_date": "2014-12-19", "developer": "Kunos Simulazioni", "platforms": "windows", "short_description": "Assetto Corsa v1.16 introduces the new &quot;Laguna Seca&quot; laser-scanned track, 7 new cars among which the eagerly awaited Alfa Romeo Giulia Quadrifoglio! Check the changelog for further info!"}, {"appid": 104200, "name": "BEEP", "release_date": "2011-05-06", "developer": "Big Fat Alien", "platforms": "windows", "short_description": "A combination of platforming with a gravity gun, BEEP is an amazing physics-platformer. Despite its friendly art style, this is a hardcore platformer in the truest sense."}, {"appid": 511470, "name": "Glass Masquerade", "release_date": "2016-11-18", "developer": "Onyx Lute", "platforms": "windows;mac", "short_description": "Welcome to Glass Masquerade - an artistic puzzle game inspired by Art Deco &amp; stained glass artisans of the 20th century. You need to combine hidden glass pieces to unveil clocks and themes exhibited by various cultures of the world at the 'International Times Exhibition' - an interactive electronic show."}, {"appid": 308600, "name": "Geneshift", "release_date": "2017-05-23", "developer": "Nik Nak Studios", "platforms": "windows;linux", "short_description": "Geneshift is a GTA-inspired battle royale where each round lasts only two minutes. Use exploding cars, miniguns, invisibility, and more to outplay friends in tactical online combat. Loot for special powers, build secret bases, and be the last man standing!"}, {"appid": 244450, "name": "Men of War: Assault Squad 2", "release_date": "2014-05-15", "developer": "Digitalmindsoft", "platforms": "windows", "short_description": "Men of War: Assault Squad 2 features new single player style skirmish modes that take players from extreme tank combat to deadly sniper stealth missions. Commanders can now faceoff against opponents on various new multiplayer 1v1 – 8v8 maps."}, {"appid": 102840, "name": "Shank 2", "release_date": "2012-02-07", "developer": "Klei Entertainment", "platforms": "windows;mac;linux", "short_description": "The fan-favorite 2D brawler is back as ex-mob hit man Shank returns to action in Shank 2. With those closest to him under attack, Shank is once again forced on the offensive. Now he must put his trusty arsenal of handguns, shotguns, automatic weapons, chainsaws, machetes, grenades, plus all-new weaponry and moves to use in order to..."}, {"appid": 544920, "name": "Darwin Project", "release_date": "2018-03-09", "developer": "Scavengers Studio", "platforms": "windows", "short_description": "Darwin Project takes the battle royale genre up north, where an impending ice age has given rise to a twisted new reality show in which ten participants must fight to the death under the Show Director's gaze."}, {"appid": 102500, "name": "Kingdoms of Amalur: Reckoning™", "release_date": "2012-02-09", "developer": "Big Huge Games;38 Studios", "platforms": "windows", "short_description": "The Legend of Dead Kel DLC is now available! The legendary pirate Dead Kel and his Hanged Men have returned to haunt the seas of northern Amalur."}, {"appid": 664430, "name": "WWE 2K18", "release_date": "2017-10-17", "developer": "Visual Concepts;Yuke's Co., LTD", "platforms": "windows", "short_description": "WWE fans, sports gamers, and fighting game fanatics - the biggest video game franchise in WWE history is back with WWE 2K18!"}, {"appid": 436150, "name": "Governor of Poker 3", "release_date": "2016-02-19", "developer": "Azerion;YoudaGames", "platforms": "windows;mac", "short_description": "Governor of Poker 3 is the best free multiplayer poker game with a great design. In this multi-player version of Governor of Poker you compete live with thousands of real poker players to prove you are the number 1 Texas Hold ’em poker star!"}, {"appid": 436180, "name": "Spacelords", "release_date": "2017-09-22", "developer": "MercurySteam", "platforms": "windows", "short_description": "Embark on an epic sci-fi, free-to-play adventure. Spacelords is a brand-new take on the shooter genre. Through its 4 vs 1 campaign, you experience both sides of the story: Join the Raiders in their fight to free the legendary Broken Planet, or switch sides and fight as the Antagonist alongside the invading hordes!"}, {"appid": 99700, "name": "NightSky", "release_date": "2011-03-01", "developer": "Nicalis, Inc.", "platforms": "windows;mac;linux", "short_description": "Nominated as a IGF Seamus McNally Finalist, NightSky is an ambient action-puzzle game that offers a gameplay experience unlike any other—cerebral challenges fill uniquely designed picturesque worlds. The player must maneuver a sphere by using realistic physics to advance; each of these worlds is broken into different areas."}, {"appid": 99300, "name": "Renegade Ops", "release_date": "2011-10-26", "developer": "Avalanche Studios", "platforms": "windows", "short_description": "Blast your way through enemy lines to defeat Inferno, a madman intent on global domination. Destruction just got awesome."}, {"appid": 638070, "name": "Murderous Pursuits", "release_date": "2018-04-26", "developer": "Blazing Griffin", "platforms": "windows", "short_description": "Murderous Pursuits is a kill-or-be-killed Victorian stealth-em-up for 1-8 players in which you must hunt and kill your quarry before your hunters do the same to you, all while avoiding witnesses."}, {"appid": 31270, "name": "Puzzle Agent", "release_date": "2010-07-01", "developer": "Telltale Games", "platforms": "windows;mac", "short_description": "When White House inquiries to the Scoggins Eraser Co. are answered only with curious puzzles, Nelson Tethers from the U.S. Department of Puzzle Research is sent on the case. The strange events in Scoggins will challenge every ounce of Tethers’ expertise, and possibly his very wits too, with brainteasers at every turn: mazes, logic..."}, {"appid": 244090, "name": "Sid Meier’s Ace Patrol: Pacific Skies", "release_date": "2013-11-05", "developer": "Firaxis Games", "platforms": "windows", "short_description": "Battle to Rule the Pacific Skies!Take flight over the treacherous Pacific waters where ace pilots redefine historic World War II battles! Skillfully pilot the most iconic American and Japanese fighter planes of the Pacific War while representing the army or navy."}, {"appid": 244070, "name": "Sid Meier’s Ace Patrol", "release_date": "2013-08-27", "developer": "Firaxis Games", "platforms": "windows", "short_description": "Battle to Rule the Skies!The skies over Europe are a dangerous place, where ace pilots lead their squadrons to glorious victory or crushing defeat! Take control of dozens of the most famous fighter planes of WWI and head into the dogfight. Roll, slip, and loop to get the drop on enemy aces."}, {"appid": 107310, "name": "Cthulhu Saves the World", "release_date": "2011-07-13", "developer": "Zeboyd Games", "platforms": "windows", "short_description": "The lord of insanity, Cthulhu was all set to plunge the world into insanity and destruction when his powers were sealed by a mysterious sorcerer. The only way for him to break the curse is to become a true hero. Save the world to destroy it in an epic parody RPG journey of redemption, romance, and insanity!"}, {"appid": 270850, "name": "Car Mechanic Simulator 2014", "release_date": "2014-01-24", "developer": "PlayWay S.A.;Red Dot Games", "platforms": "windows;mac", "short_description": "Now you can own and operate your own auto repair service with PlayWay’s Car Mechanic Simulator 2014. Car Mechanic Simulator 2014 gives you the behind the scenes view of the daily dealings at local garages and dealership repair shops."}, {"appid": 108600, "name": "Project Zomboid", "release_date": "2013-11-08", "developer": "The Indie Stone", "platforms": "windows;mac;linux", "short_description": "Project Zomboid is the ultimate in zombie survival. Alone or in MP: you loot, build, craft, fight, farm and fish in a struggle to survive. A hardcore RPG skillset, a vast map, a massively customisable sandbox and a cute tutorial raccoon await the unwary. So how will you die?"}, {"appid": 386940, "name": "Ultimate Chicken Horse", "release_date": "2016-03-04", "developer": "Clever Endeavour Games", "platforms": "windows;mac;linux", "short_description": "Ultimate Chicken Horse is a party platformer game where you build the level as you play, placing traps and hazards to screw your friends over, but trying not to screw yourself."}, {"appid": 26900, "name": "Crayon Physics Deluxe", "release_date": "2009-05-06", "developer": "Kloonigames", "platforms": "windows;mac", "short_description": "Crayon Physics Deluxe is a 2D physics puzzle / sandbox game, in which you get to experience what it would be like if your drawings would be magically transformed into real physical objects. Solve puzzles with your artistic vision and creative use of physics."}, {"appid": 324810, "name": "TOXIKK™", "release_date": "2016-09-10", "developer": "Reakktor Studios", "platforms": "windows", "short_description": "FRAG LIKE IT'S 1999! TOXIKK plays as if today's military shooters never existed: Designed as a spiritual successor to the FPS giants of the late 90s and early 2ks, TOXIKK carefully evolves their mechanics with modern technology and fresh ideas elaborated with Arena-FPS enthusiasts."}, {"appid": 243470, "name": "Watch_Dogs™", "release_date": "2014-05-26", "developer": "Ubisoft", "platforms": "windows", "short_description": "In today's hyper-connected world, Chicago operates under ctOS, the most advanced computer network in America."}, {"appid": 107300, "name": "Breath of Death VII", "release_date": "2011-07-13", "developer": "Zeboyd Games", "platforms": "windows", "short_description": "Resurrect the classic era of RPGs with the retro parody RPG, Breath of Death VII: The Beginning. Join Dem the Skeleton Knight, Sara the ghost historian, Lita the vampire techie, and Erik the zombie prince as they explore an undead world in search of the secrets of the past. Laugh! Cry! Laugh some more!"}, {"appid": 29180, "name": "Osmos", "release_date": "2009-08-18", "developer": "Hemisphere Games", "platforms": "windows;mac;linux", "short_description": "Enter the ambient world of Osmos: elegant, physics-based gameplay, dreamlike visuals, and a minimalist, electronic soundtrack. Your objective is to grow by absorbing other motes. Propel yourself by ejecting matter behind you. But be wise: ejecting matter also shrinks you. Relax - good things come to those who wait."}, {"appid": 107200, "name": "Space Pirates and Zombies", "release_date": "2011-08-15", "developer": "MinMax Games Ltd.", "platforms": "windows;mac;linux", "short_description": "Explore a randomly generated Galaxy populated with factions, enemies, missions, and items providing you with a unique experience each time you play."}, {"appid": 305260, "name": "Battle Islands", "release_date": "2014-08-06", "developer": "DR Studios", "platforms": "windows", "short_description": "Battle friends over air, land and sea in this epic WW2-themed battle strategy game."}, {"appid": 409160, "name": "Dr. Langeskov, The Tiger, and The Terribly Cursed Emerald: A Whirlwind Heist", "release_date": "2015-12-04", "developer": "Crows Crows Crows", "platforms": "windows;mac", "short_description": "A 15 minute heist game by Crows Crows Crows &amp; Directed by William Pugh (The Stanley Parable). Slip into the soft-soled shoes of the mastermind responsible for the greatest heist- oh god I can’t do this any more, i’m joining the strike. good luck writing the steam description."}, {"appid": 243970, "name": "Invisible, Inc.", "release_date": "2015-05-12", "developer": "Klei Entertainment", "platforms": "windows;mac;linux", "short_description": "Take control of Invisible's agents in the field and infiltrate the world's most dangerous corporations. Stealth, precision, and teamwork are essential in high-stakes, high-profit missions, where every move may cost an agent their life."}, {"appid": 28000, "name": "Kane & Lynch 2: Dog Days", "release_date": "2010-08-17", "developer": "IO Interactive", "platforms": "windows", "short_description": "Pure adrenaline of non-stop action in Single Player, Online Co-op and Multiplayer. Double the pleasure and mayhem with new multiplayer DLCs!"}, {"appid": 308040, "name": "Back to Bed", "release_date": "2014-08-06", "developer": "Bedtime Digital Games", "platforms": "windows;mac;linux", "short_description": "Guide Bob the sleepwalker to the safety of his bed by taking control of his subconscious guardian, Subob. Explore a surreal and hand-painted dream world, avoid dangers and get Bob safely back to bed."}, {"appid": 387990, "name": "Scrap Mechanic", "release_date": "2016-01-19", "developer": "Axolot Games", "platforms": "windows", "short_description": "Welcome to the machine-filled creative paradise of Scrap Mechanic, a multiplayer sandbox game with imagination and ingenuity at its core. Create fantastic machines, transforming vehicles or sneaky traps. The possibilities are endless with Scrap Mechanics powerful tools."}, {"appid": 591740, "name": "Sniper Fury", "release_date": "2017-06-13", "developer": "Gameloft", "platforms": "windows", "short_description": "Sniper Fury is an action-sharpshooting game set in a world threatened by violence. Neutralize threats using an ever-growing arsenal of modern firepower. Customize everything: weapons, gear sets, bullets! Join other snipers in Clan Wars, challenge them in PvP mode, &amp; try events for extra surprises."}, {"appid": 22300, "name": "Fallout 3", "release_date": "2008-10-28", "developer": "Bethesda Game Studios", "platforms": "windows", "short_description": "Vault-Tec engineers have worked around the clock on an interactive reproduction of Wasteland life for you to enjoy from the comfort of your own vault. Included is an expansive world, unique combat, shockingly realistic visuals, tons of player choice, and an incredible cast of dynamic characters."}, {"appid": 845070, "name": "The Awesome Adventures of Captain Spirit", "release_date": "2018-06-25", "developer": "DONTNOD Entertainment", "platforms": "windows", "short_description": "Have you ever dreamt of being a superhero? Meet Chris, a creative and imaginative 9 year old boy who escapes reality with fantastical adventures as his alter ego, the Awesome Captain Spirit! Captain Spirit is a free demo set in the Life is Strange universe."}, {"appid": 204060, "name": "Superbrothers: Sword & Sworcery EP", "release_date": "2012-04-16", "developer": "Capybara;Superbrothers;Jim Guthrie", "platforms": "windows;mac;linux", "short_description": "Traverse a mythic little realm, use a sword to do battle & evoke sworcery to solve mystical musical mysteries."}, {"appid": 204030, "name": "Fable - The Lost Chapters", "release_date": "2011-12-19", "developer": "Lionhead Studios", "platforms": "windows", "short_description": "Each person you aid, each flower you crush, and each creature you slay will change this world forever. Fable: Who will you be?"}, {"appid": 203750, "name": "Binary Domain", "release_date": "2012-04-26", "developer": "Devil's Details", "platforms": "windows", "short_description": "Set in futuristic Tokyo, take control of the robotic community before they control everything!"}, {"appid": 236150, "name": "Starpoint Gemini 2", "release_date": "2014-09-26", "developer": "Little Green Men Games", "platforms": "windows", "short_description": "Captain your own space ship and roam the galaxy in 3D in this tactical space simulator with tons of RPG depth ! Space has never looked so inviting - but images can betray...It has been two years since the end of the second Gemini war, the situation in the wartorn system is further from resolution than ever."}, {"appid": 459820, "name": "Crush Crush", "release_date": "2016-10-18", "developer": "Sad Panda Studios", "platforms": "windows;mac;linux", "short_description": "Hey hot stuff! Are you looking for a fun and flirty game to kill some time and make you laugh out loud? That’s a crazy coincidence, because it’s been looking for you! Welcome to Crush Crush – the Idle Dating Sim!"}, {"appid": 203630, "name": "Warlock - Master of the Arcane", "release_date": "2012-05-08", "developer": "Ino-Co Plus", "platforms": "windows", "short_description": "In a time of chaotic upheaval, the player takes the role of a great mage, a warlord vying for ultimate power."}, {"appid": 302380, "name": "Floating Point", "release_date": "2014-06-06", "developer": "Suspicious Developments", "platforms": "windows;mac;linux", "short_description": "Floating Point is a peaceful, free game about using a grappling hook to swing yourself gracefully through randomly generated spaces. The only objective is to collect points, and the only thing that increases your points is swinging swiftly, smoothly and elegantly without hitting anything."}, {"appid": 489520, "name": "Minion Masters", "release_date": "2016-12-02", "developer": "BetaDwarf", "platforms": "windows", "short_description": "Dive into 1v1 - or bring a friend to 2v2 - battle in this dangerously addictive fast-paced hybrid of deckbuilder, MOBA, and tower-defense."}, {"appid": 274560, "name": "Revolution Ace", "release_date": "2014-03-19", "developer": "Laser Guided Games, LLC", "platforms": "windows", "short_description": "A deep, tactical shoot'em up. With every takedown, you’ll earn cash and xp to upgrade your ship and unlock new abilities. Online and local co-op. Unique versus mode. Realistic physics and water simulation."}, {"appid": 17330, "name": "Crysis Warhead®", "release_date": "2008-09-17", "developer": "Crytek", "platforms": "windows", "short_description": "Pulse-racing new installment from 2007's PC Game of the Year*: Play as Sergeant Sykes and experience a whole new side of the battle. A standard combat mission behind enemy lines becomes critical when you discover your enemies have captured something of vital importance to the ensuing war."}, {"appid": 382490, "name": "Relic Hunters Zero", "release_date": "2015-08-18", "developer": "Rogue Snail", "platforms": "windows;mac", "short_description": "Relic Hunters Zero is a FREE game about shooting evil space ducks and evil space turtles with tiny cute guns. It’s fast, it’s tactical, and feels delicious and smooth to play. Unlock new weapons, characters and relics to defeat the Ducan Commander."}, {"appid": 17440, "name": "SPORE™ Creepy & Cute Parts Pack", "release_date": "2008-12-19", "developer": "Maxis™", "platforms": "windows", "short_description": "Add horror and humor to your universe. Make grotesque beasts or cuddly critters, then watch them do the robot, zombie walk, break dance and more! Includes over 100 new items."}, {"appid": 17450, "name": "Dragon Age: Origins", "release_date": "2009-11-05", "developer": "BioWare", "platforms": "windows", "short_description": "You are a Grey Warden, one of the last of a legendary order of guardians. With the return of an ancient foe and the kingdom engulfed in civil war, you have been chosen by fate to unite the shattered lands and slay the archdemon once and for all."}, {"appid": 17480, "name": "Command & Conquer: Red Alert 3", "release_date": "2009-01-08", "developer": "EA Los Angeles", "platforms": "windows", "short_description": "The desperate leadership of a doomed Soviet Union travels back in time to change history and restore the glory of Mother Russia. The time travel mission goes awry, creating an alternate timeline where technology has followed an entirely different evolution, a new superpower has been thrust on to the world stage, and World War III is..."}, {"appid": 17500, "name": "Zombie Panic! Source", "release_date": "2008-10-03", "developer": "Zombie Panic Team", "platforms": "windows;linux", "short_description": "Dive into the zombie apocalypse with Zombie Panic! Source: a cooperative, survival-horror first-person-shooter. A fast-paced standalone modification."}, {"appid": 17570, "name": "Pirates, Vikings, and Knights II", "release_date": "2010-02-12", "developer": "Octoshark Studios", "platforms": "windows;mac;linux", "short_description": "Pirates, Vikings, and Knights II pits three teams against each other in a struggle for wealth, power and total domination. Whether using the Gunpowder Keg to clear out a territory full of enemies, or the Javelin to pin your dead foes to a wall, you'll find this game both hilarious and exhilarating."}, {"appid": 204180, "name": "Waveform", "release_date": "2012-03-20", "developer": "Eden Industries", "platforms": "windows;mac;linux", "short_description": "Navigate the beauty and hazards of the solar system while riding a wave of light through 100+ levels in this innovative action-puzzle game!"}, {"appid": 339800, "name": "HuniePop", "release_date": "2015-01-19", "developer": "HuniePot", "platforms": "windows;mac;linux", "short_description": "HuniePop is a unique sim experience for PC, Mac and Linux. It's a gameplay first approach that's part dating sim, part puzzle game, with light RPG elements, a visual novel style of presentation, an abrasive western writing style and plenty of &quot;plot&quot;."}, {"appid": 204240, "name": "The Bridge", "release_date": "2013-02-22", "developer": "Ty Taylor and Mario Castañeda;The Quantum Astrophysicists Guild", "platforms": "windows;mac;linux", "short_description": "The Bridge is a logic puzzle game that forces you to reevaluate your preconceptions of physics and perspective. It is Isaac Newton meets M. C. Escher. Manipulate gravity to redefine the ceiling as the floor while venturing through impossible architectures."}, {"appid": 204340, "name": "Serious Sam 2", "release_date": "2012-01-31", "developer": "Croteam", "platforms": "windows", "short_description": "Serious Sam 2 is a shot of adrenaline to the hearts of first-person shooter fans across the world. This is serious!"}, {"appid": 589870, "name": "Learn to Fly 3", "release_date": "2017-05-12", "developer": "Light Bringer Games inc.", "platforms": "windows", "short_description": "Build your spaceship from scratch, earn funds and invest them into building a bigger, better spaceship as you try and fly your way up to space!"}, {"appid": 234670, "name": "NARUTO SHIPPUDEN: Ultimate Ninja STORM 3 Full Burst HD", "release_date": "2013-10-24", "developer": "CyberConnect2 Co. Ltd.", "platforms": "windows", "short_description": "Live the 4th Great Ninja War and its overpowering boss fights or defy your friends in ultra dynamic online and offline ninja confrontations!"}, {"appid": 301640, "name": "Zombie Army Trilogy", "release_date": "2015-03-06", "developer": "Rebellion", "platforms": "windows", "short_description": "The cult horror shooter series comes to an apocalyptic conclusion with an epic new third chapter, a heart-pumping new horde mode, and remastered editions of the best-selling Nazi Zombie Army 1 &amp; 2."}, {"appid": 667890, "name": "Dead Maze", "release_date": "2018-02-13", "developer": "Atelier 801", "platforms": "windows;mac;linux", "short_description": "Dead Maze is a 2D MMO game set in a destroyed contemporary world, filled with zombies. Explore the world, scavenge and craft as many items as possible, to survive the hostile environment and upgrade your gear and camp as you go."}, {"appid": 235210, "name": "STRIDER™ / ストライダー飛竜®", "release_date": "2014-02-19", "developer": "Double Helix Games;Capcom", "platforms": "windows", "short_description": "Strider returns in a brand new adventure, complete with incredible side-scrolling action, and lightning fast combat all in a massive interconnected world! Download the full game February 19th and become the original assassin!"}, {"appid": 380840, "name": "Teeworlds", "release_date": "2015-08-24", "developer": "Teeworlds Team", "platforms": "windows;mac;linux", "short_description": "Teeworlds is a free online multiplayer game, available for all major operating systems. Battle with up to 16 players in a variety of game modes, including Team Deathmatch and Capture The Flag. You can even design your own maps!"}, {"appid": 678800, "name": "SAS: Zombie Assault 4", "release_date": "2017-10-16", "developer": "Ninja Kiwi", "platforms": "windows;mac", "short_description": "Purge the undead! Intense action-shooter with deep rpg elements, including upgradeable guns and armor, unique class skills, and class special abilities. Entire game can be played single player or as a 4-player online co-op game, including PvP events like Last Man Standing."}, {"appid": 235340, "name": "Prime World", "release_date": "2014-03-31", "developer": "Nival", "platforms": "windows", "short_description": "Prime World is a free online game in RPG / MOBA genre with a unique universe where tactical session battles, castle management, and hero development are mixed together. Gather your collection of talents, build an army of invincible heroes and become the champion!"}, {"appid": 644560, "name": "Mirror", "release_date": "2018-04-19", "developer": "KAGAMI WORKs", "platforms": "windows;mac", "short_description": "This is a game that combines match-3, GALGAME elements and beauties. If you want to learn more about those beauties, you need to best them first. How the story goes is choice-based so your choices will ultimately decide their fate."}, {"appid": 339600, "name": "VEGA Conflict", "release_date": "2015-12-14", "developer": "KIXEYE", "platforms": "windows;mac", "short_description": "Stake your claim, command your fleets, and wage epic war in space."}, {"appid": 235460, "name": "METAL GEAR RISING: REVENGEANCE", "release_date": "2014-01-09", "developer": "PlatinumGames", "platforms": "windows", "short_description": "Developed by Kojima Productions and PlatinumGames, METAL GEAR RISING: REVENGEANCE takes the renowned METAL GEAR franchise into exciting new territory with an all-new action experience. The game seamlessly melds pure action and epic story-telling that surrounds Raiden – a child soldier transformed into a half-human, half-cyborg ninja who..."}, {"appid": 235600, "name": "Tom Clancy’s Splinter Cell Blacklist", "release_date": "2013-08-23", "developer": "Ubisoft Toronto", "platforms": "windows", "short_description": "The United States has a military presence in two-thirds of countries around the world, and some of them have had enough. A group of terrorists calling themselves The Engineers initiate a terror ultimatum called the Blacklist - a deadly countdown of escalating attacks on U.S. interests."}, {"appid": 460920, "name": "Steep™", "release_date": "2016-12-02", "developer": "Ubisoft Annecy;Ubisoft Montpellier;Ubisoft Kiev", "platforms": "windows", "short_description": "Ride a massive open world across the Alps, where the powder is always fresh and the run never ends. Defy and master the mountain alone or with friends on skis, wingsuits, snowboards and paragliders. Record and share your best stunts."}, {"appid": 301910, "name": "Saints Row: Gat out of Hell", "release_date": "2015-01-22", "developer": "Deep Silver Volition;High Voltage Software", "platforms": "windows;linux", "short_description": "Join Johnny Gat &amp; Kinzie Kensington as you tear apart Hell in a quest to save the Boss’ soul. Historical icons, old friends, older enemies, a talking gun, a full length musical number &amp; a whole lot more shenanigans await!"}, {"appid": 460790, "name": "Bayonetta", "release_date": "2017-04-11", "developer": "PlatinumGames", "platforms": "windows", "short_description": "PlatinumGames’ universally acclaimed action masterpiece finally comes to PC. Experience the over-the-top stylish action in 60fps at unlocked HD resolutions. The definitive way to play: being bad never felt so good."}, {"appid": 302670, "name": "Call to Arms", "release_date": "2018-04-27", "developer": "Digitalmindsoft", "platforms": "windows", "short_description": "Call to Arms offers an innovative mix of real-time strategy and 3rd, as well as 1st person controls. Set in the time of modern warfare, the game offers realistically modeled vehicles and heavy weaponry, as well as dozens of firearms and customizations."}, {"appid": 513560, "name": "Hunger Dungeon", "release_date": "2016-12-06", "developer": "Buka Game Studio", "platforms": "windows;mac;linux", "short_description": "Hunger Dungeon is a 1-6 player round-based Multiplayer Online Battle Arena game with a special pixel art style. Battle with more than 12 unique characters in fast-paced Free-for-All and Team Deathmatch rounds. Or take on the challenging Dragon Mode - the exciting first PvE mode!"}, {"appid": 383120, "name": "Empyrion - Galactic Survival", "release_date": "2015-08-05", "developer": "Eleon Game Studios", "platforms": "windows", "short_description": "Empyrion - Galactic Survival is a 3D open world space sandbox survival adventure. Build powerful ships, mighty space stations and vast planetary settlements to explore, conquer or exploit a variety of different planets and discover the mysteries of Empyrion!"}, {"appid": 238260, "name": "Pinball Arcade", "release_date": "2013-11-04", "developer": "FarSight Studios", "platforms": "windows;mac", "short_description": "Pinball Arcade by FarSight Studios features exact recreations of the all-time greatest pinball tables from Stern Pinball® and Gottlieb® together in one game. Every flipper, bumper, sound effect, and display pixel has been painstakingly emulated in astonishing detail."}, {"appid": 641990, "name": "The Escapists 2", "release_date": "2017-08-21", "developer": "Team17 Digital Ltd;Mouldy Toof Studios", "platforms": "windows;mac;linux", "short_description": "Craft, Steal, Brawl and Escape! It’s time to bust out of the toughest prisons in the world as you return to the life of an inmate in The Escapists 2, now with multiplayer! Have you got what it takes to escape?"}, {"appid": 32360, "name": "The Secret of Monkey Island: Special Edition", "release_date": "2009-07-15", "developer": "LucasArts", "platforms": "windows", "short_description": "Back by popular demand, The Secret of Monkey Island™: Special Edition faithfully re-imagines the internationally-acclaimed classic game (originally released in 1990) for original and new audiences alike."}, {"appid": 384190, "name": "ABZU", "release_date": "2016-08-02", "developer": "Giant Squid", "platforms": "windows", "short_description": "From the art director of Journey®, ABZÛ is a beautiful underwater adventure that evokes the dream of diving. Immerse yourself in a vibrant hidden world bursting with color and life as you descend into the heart of the ocean. But beware as you swim deeper as dangers lurk in the depths."}, {"appid": 200900, "name": "Cave Story+", "release_date": "2011-11-22", "developer": "Nicalis, Inc.;Studio Pixel", "platforms": "windows;linux", "short_description": "Run, jump, shoot, fly and explore your way through a massive action-adventure reminiscent of classic 8- and 16-bit games."}, {"appid": 666220, "name": "CS2D", "release_date": "2017-11-15", "developer": "Unreal Software", "platforms": "windows;mac;linux", "short_description": "CS2D is a free fast-paced top-down multiplayer shooter. Featuring many different game modes, a built-in map editor and much more."}, {"appid": 304240, "name": "Resident Evil / biohazard HD REMASTER", "release_date": "2015-01-19", "developer": "CAPCOM Co., Ltd.", "platforms": "windows", "short_description": "The game that defined the survival-horror genre is back! Check out the remastered HD version of Resident Evil."}, {"appid": 326960, "name": "Killing Floor - Toy Master", "release_date": "2014-10-16", "developer": "David Hensley;Alex Quick", "platforms": "windows;mac;linux", "short_description": "In a free, add-on mod for Killing Floor, created by David Hensley (with help from Killing Floor originator, Alex Quick), you can fight off the bizarre and warped toys of someone's nightmare, that are hell-bent on finishing you off. All the standard Zeds are replaced with evil toys, set in the Devil's Dollhouse map."}, {"appid": 304430, "name": "INSIDE", "release_date": "2016-07-07", "developer": "Playdead", "platforms": "windows", "short_description": "Hunted and alone, a boy finds himself drawn into the center of a dark project."}, {"appid": 666140, "name": "My Time At Portia", "release_date": "2019-01-15", "developer": "Pathea Games", "platforms": "windows", "short_description": "Start a new life in the enchanting town of Portia! Restore your Pa's neglected workshop to its former glory by fulfilling commissions, growing crops, raising animals, and befriending the quirky inhabitants of this charming post-apocalyptic land!"}, {"appid": 304650, "name": "SUNLESS SEA", "release_date": "2015-02-06", "developer": "Failbetter Games", "platforms": "windows;mac;linux", "short_description": "LOSE YOUR MIND. EAT YOUR CREW. DIE. Take the helm of your steamship and set sail for the unknown! Sunless Sea is a game of discovery, loneliness and frequent death, set in the award-winning Victorian Gothic universe of Fallen London."}, {"appid": 622650, "name": "Bendy and the Ink Machine™", "release_date": "2017-04-27", "developer": "Joey Drew Studios Inc.", "platforms": "windows;mac;linux", "short_description": "&quot;Bendy and the Ink Machine™&quot; is the first person puzzle action horror game that will forever ruin your childhood love of cartoons."}, {"appid": 239070, "name": "Hammerwatch", "release_date": "2013-08-12", "developer": "Crackshell", "platforms": "windows;mac;linux", "short_description": "A hack and slash action adventure, set in a fantasy pixel art environment. Play solo or co-op in this adventure from bottom to top of Castle Hammerwatch. Kill hordes of enemies with varied looks and features through four unique environments with traps, hidden secrets and puzzles."}, {"appid": 274920, "name": "FaceRig", "release_date": "2015-07-07", "developer": "Holotech Studios", "platforms": "windows", "short_description": "FaceRig is a program that aims to enable anyone with a webcam to digitally embody awesome characters. The output can be recorded as a movie or streamed to Skype, Twitch, Hangouts or any service that traditionally uses a webcam in real time."}, {"appid": 274900, "name": "Murder Miners", "release_date": "2014-07-25", "developer": "JForce Games", "platforms": "windows;mac;linux", "short_description": "The #1 rated Xbox Live Indie Game. Halo-inspired. Destructible/constructible environments. Vehicles. Zombie survival. Hookshots. Infection mode: Be the zombie &amp; eat the dead to level up your zombie abilities. We host 30-player games every week. Join us!"}, {"appid": 22180, "name": "Penumbra Overture", "release_date": "2009-03-06", "developer": "Frictional Games", "platforms": "windows;mac;linux", "short_description": "Penumbra: Overture is a first person survival horror game, emphasizing on survival and problem solving instead of mindless violence and gore."}, {"appid": 383980, "name": "Rivals of Aether", "release_date": "2017-03-28", "developer": "Dan Fornace", "platforms": "windows", "short_description": "RIVALS OF AETHER is an indie fighting game set in a world where warring civilizations summon the power of Fire, Water, Air, and Earth. Play with up to four players locally or up to two players online."}, {"appid": 238210, "name": "System Shock 2", "release_date": "2013-05-10", "developer": "Irrational Games;Looking Glass Studios", "platforms": "windows;mac", "short_description": "&quot;Remember, it is my will that guided you here. It is my will that gave you your cybernetic implants, the only beauty in that meat you call a body. If you value that meat... you will do as I tell you.&quot; The cult classic sci-fi horror FPS-RPG has returned."}, {"appid": 327890, "name": "I am Bread", "release_date": "2015-04-09", "developer": "Bossa Studios", "platforms": "windows;mac", "short_description": "You are bread. Your mission, become toast! Take on all hazards to deliciousness as you head on an epic adventure in one of the the toughest games ever baked. All of the game modes (including Bagel Race) are now unlocked so there's sure to be something to suit everyone's taste!"}, {"appid": 20550, "name": "Red Faction II", "release_date": "2009-08-06", "developer": "Volition, Inc.", "platforms": "windows", "short_description": "Twenty-second century Earth. Five years after the rebellion on Mars. For the last 15 years, Sopot, the corrupt dictator, has oppressed the people of the Commonwealth. His relentless pursuit of unification with the neighboring United Republic has left the country soaked in unnecessary bloodshed and poverty."}, {"appid": 411300, "name": "ELEX", "release_date": "2017-10-17", "developer": "Piranha Bytes", "platforms": "windows", "short_description": "ELEX is a handcrafted action role-playing experience from the award-winning creators of the Gothic series, set in a brand new post-apocalyptic Science Fantasy universe that puts players into a huge seamless game world full of original characters, mutated creatures, deep moral choices and powerful action."}, {"appid": 202200, "name": "Galactic Civilizations® II: Ultimate Edition", "release_date": "2011-12-02", "developer": "Stardock Entertainment", "platforms": "windows", "short_description": "Get the complete GalCiv II saga including Galactic Civilizations II: Dread Lords, the expansion pack Dark Avatar, and the newest expansion pack Twilight of the Arnor!"}, {"appid": 18500, "name": "Defense Grid: The Awakening", "release_date": "2008-12-08", "developer": "Hidden Path Entertainment", "platforms": "windows", "short_description": "Defense Grid: The Awakening is a unique spin on tower defense gameplay that will appeal to players of all skill levels. A horde of enemies is invading, and it's up to the player to stop them by strategically building fortification towers around their base."}, {"appid": 201870, "name": "Assassin's Creed® Revelations", "release_date": "2011-11-30", "developer": "Ubisoft Montreal", "platforms": "windows", "short_description": "Ezio Auditore walks in the footsteps of the legendary mentor Altair, on a dangerous journey of discovery and revelation."}, {"appid": 548430, "name": "Deep Rock Galactic", "release_date": "2018-02-28", "developer": "Ghost Ship Games", "platforms": "windows", "short_description": "Deep Rock Galactic is a 1-4 player co-op FPS featuring badass space Dwarves, 100% destructible environments, procedurally-generated caves, and endless hordes of alien monsters."}, {"appid": 433350, "name": "BlackShot: Mercenary Warfare FPS", "release_date": "2016-05-31", "developer": "Vertigo Games America", "platforms": "windows", "short_description": "BlackShot is a free-to-play, first-person shooter set in a post-apocalyptic world.Join other mercenaries in brutal team combat, multiple game modes, and experience in-depth customization to create your perfect warrior!"}, {"appid": 490220, "name": "Prismata", "release_date": "2018-03-08", "developer": "Lunarch Studios", "platforms": "windows;mac", "short_description": "A perfect-information strategy game inspired by RTS, deckbuilders, and board games. Choose from three distinct technology classes and outwit your foes by snowballing your starting resources into a powerful cybernetic army. ABSOLUTELY NO PAY-TO-WIN."}, {"appid": 201570, "name": "Really Big Sky", "release_date": "2012-02-24", "developer": "Boss Baddie", "platforms": "windows", "short_description": "A super fast, twin analogue shooter for the modern age!"}, {"appid": 237990, "name": "The Banner Saga", "release_date": "2014-01-14", "developer": "Stoic", "platforms": "windows;mac", "short_description": "Live through an epic role-playing Viking saga where your strategic choices directly affect your personal journey. Make allies as you travel with your caravan across this stunning yet harsh landscape. Carefully choose those who will help fight a new threat that jeopardizes an entire civilization."}, {"appid": 383580, "name": "Flesh Eaters", "release_date": "2016-05-03", "developer": "S.C. 16 BIT NIGHTS S.R.L.", "platforms": "windows", "short_description": "Flesh Eaters is retro style single player RTS zombie survival game with resource gathering and crafting. Zombies are everywhere! You must gather resources to build barricades, upgrade weapons and armour and explore the city under the siege of the..."}, {"appid": 201480, "name": "Serious Sam: The Random Encounter", "release_date": "2011-10-24", "developer": "Vlambeer;Croteam", "platforms": "windows", "short_description": "Choose your weapons and take aim at the most random Serious Sam adventure yet!"}, {"appid": 383870, "name": "Firewatch", "release_date": "2016-02-09", "developer": "Campo Santo", "platforms": "windows;mac;linux", "short_description": "Firewatch is a single-player first-person mystery set in the Wyoming wilderness, where your only emotional lifeline is the person on the other end of a handheld radio."}, {"appid": 569480, "name": "Kingdoms and Castles", "release_date": "2017-07-20", "developer": "Lion Shield, LLC", "platforms": "windows;mac;linux", "short_description": "Kingdoms and Castles is a game about growing a kingdom from a tiny hamlet to a sprawling city and imposing castle."}, {"appid": 20510, "name": "S.T.A.L.K.E.R.: Clear Sky", "release_date": "2008-09-15", "developer": "GSC Game World", "platforms": "windows", "short_description": "S.T.A.L.K.E.R.: Clear Sky – standalone prequel for the acclaimed S.T.A.L.K.E.R.: Shadow of Chernobyl, which tells you story about the Clear Sky group, that want to research the Zone and understand it better."}, {"appid": 201230, "name": "EverQuest II", "release_date": "2011-12-07", "developer": "Daybreak Game Company", "platforms": "windows", "short_description": "EverQuest® II is the epitome of massively multiplayer gaming - the ultimate blend of deep features, heritage, and community."}, {"appid": 32350, "name": "STAR WARS™ Starfighter™", "release_date": "2009-07-08", "developer": "LucasArts", "platforms": "windows", "short_description": "Join three heroic starfighter pilots in harrowing deep space and planetary missions to save the planet of Naboo. Rookie Naboo pilot Rhys Dallows, mercenary Vana Sage and alien pirate Nym form an unlikely alliance as they join together against an unexpected assault on the peaceful planet."}, {"appid": 245470, "name": "Democracy 3", "release_date": "2013-10-14", "developer": "Positech Games", "platforms": "windows;mac;linux", "short_description": "Have you ever wanted to be president? or prime-minister? Convinced you could do a better job of running the country? Let's face it, you could hardly do a worse job than our current political leaders. Crime, Unemployment, National Debt, Terrorism, Climate Change..."}, {"appid": 98800, "name": "Dungeons of Dredmor", "release_date": "2011-07-13", "developer": "Gaslamp Games, Inc.", "platforms": "windows;mac;linux", "short_description": "Test your luck and cunning in this exciting RPG as you craft, cast, and pillage your way through Lord Dredmor's Dungeons."}, {"appid": 42120, "name": "Lead and Gold: Gangs of the Wild West", "release_date": "2010-04-08", "developer": "Fatshark", "platforms": "windows", "short_description": "Lead and Gold: Gangs of the Wild West is a third-person shooter that delivers an intense team-based multiplayer experience. Relive the violent era of the Wild West with adrenaline-fueled action and fast-paced gunfights. Engage in gritty battles in beautifully rendered classic Western settings."}, {"appid": 397060, "name": "Faeria", "release_date": "2017-03-08", "developer": "Abrakam SA", "platforms": "windows;mac;linux", "short_description": "With its unique living board, Faeria is also the only card game where you can gain all 300 cards in less than 50 hours."}, {"appid": 252410, "name": "SteamWorld Dig", "release_date": "2013-12-05", "developer": "Image & Form Games", "platforms": "windows;mac;linux", "short_description": "SteamWorld Dig is a platform mining adventure with strong Metroidvanian influences. Take the role of Rusty, a lone mining steambot, as he arrives at an old mining town in great need. Dig your way through the old earth, gaining riches while uncovering the ancient threat that lurks below..."}, {"appid": 397340, "name": "SimplePlanes", "release_date": "2015-12-17", "developer": "Jundroo, LLC", "platforms": "windows;mac", "short_description": "Build airplanes by snapping parts together, designing wing sections, and attaching engines. At any time, you can strap yourself into the cockpit and see how it flies with realistic physics. If you're not in the mood for building, over 100,000 airplanes are available to download for free."}, {"appid": 345180, "name": "Victor Vran ARPG", "release_date": "2015-07-24", "developer": "Haemimont Games", "platforms": "windows;mac;linux", "short_description": "Victor Vran is the isometric action-RPG where your skill is just as essential as your character build and gear. Experience intense combat action: dodge, jump and unleash powerful skills to finish off your enemies!"}, {"appid": 58610, "name": "Wargame: European Escalation", "release_date": "2012-02-22", "developer": "Eugen Systems", "platforms": "windows;mac;linux", "short_description": "The New Fatal Error DLC includes a new 5-mission Operation and touch-screen controls."}, {"appid": 41800, "name": "Gratuitous Space Battles", "release_date": "2009-11-16", "developer": "Positech Games", "platforms": "windows;mac;linux", "short_description": "Who needs backstory? Who needs resource-gathering? Diplomacy is so last year. Gratuitous Space Battles cuts right to the chase of sci-fi strategy games, and deals with large, completely unjustified space battles between huge opposing space fleets."}, {"appid": 319910, "name": "Trine 3: The Artifacts of Power", "release_date": "2015-08-20", "developer": "Frozenbyte", "platforms": "windows;mac;linux", "short_description": "Trine 3: The Artifacts of Power is a platforming game of action, puzzles and adventure, and the sequel to the award winning Trine and Trine 2. Reunite with the three heroes in an all-new adventure, now for the first time in full 3D!"}, {"appid": 315430, "name": "Polarity", "release_date": "2016-07-15", "developer": "Bluebutton Games", "platforms": "windows", "short_description": "Polarity takes it to the next level, demanding all of your wits and reflexes. Full-featured local co-op campaign."}, {"appid": 320300, "name": "Car Mechanic Simulator 2015", "release_date": "2015-04-23", "developer": "Red Dot Games", "platforms": "windows;mac", "short_description": "New cars, new tools, new options, more parts and much more fun in the next version of Car Mechanic Simulator! Take your wrench! Create and expand your auto repairs service empire. Car Mechanic Simulator 2015 will take you behind the scenes of daily routine in car workshop."}, {"appid": 319830, "name": "AX:EL - Air XenoDawn", "release_date": "2015-12-04", "developer": "Alex Piola", "platforms": "windows", "short_description": "Combining the very best of sci-fi and aerial dogfighting gameplay, AX:EL delivers a totally new gaming experience. Create your very own shape-shifting vehicle and dominate both the sky and the ocean."}, {"appid": 447820, "name": "Day of Infamy", "release_date": "2017-03-23", "developer": "New World Interactive", "platforms": "windows;mac;linux", "short_description": "Experience close-quarters battles in iconic WWII settings. Defend the line, storm the beach, torch the enemy, or use a radio to call in fire support. Day of Infamy is a teamwork-oriented shooter that will keep you on your toes and coming back for more with its diverse game modes and authentic arsenal."}, {"appid": 506140, "name": "Shop Heroes", "release_date": "2016-08-15", "developer": "Cloudcade, Inc.", "platforms": "windows", "short_description": "Craft legendary items, gear up your heroes for epic quests, and fight for the top of the Trade Wars and PvP Leaderboards in the original smash hit fantasy tycoon: Shop Heroes!"}, {"appid": 402570, "name": "Atlas Reactor", "release_date": "2016-10-04", "developer": "Trion Worlds", "platforms": "windows", "short_description": "SEASON 6 NOW LIVE! The battle for Atlas continues as a hot (some might even say fiery) new freelancer enters the scene."}, {"appid": 402390, "name": "Hyperdrive Massacre", "release_date": "2015-10-12", "developer": "34BigThings srl", "platforms": "windows;mac;linux", "short_description": "Hyperdrive Massacre is an 80s inspired arcade fragfest in Spacewar sauce designed around local multiplayer, focused on kinestetics, tactical and shooting skills at a frenzied pace."}, {"appid": 42960, "name": "Victoria II", "release_date": "2010-08-30", "developer": "Paradox Development Studio", "platforms": "windows", "short_description": "Carefully guide your nation from the era of absolute monarchies in the early 19th century, through expansion and colonization, to finally become a truly great power by the dawn of the 20th century. Victoria II is a grand strategy game played during the colonial era of the 19th century, where the player takes control of a country, guiding..."}, {"appid": 348250, "name": "Google Earth VR", "release_date": "2016-11-16", "developer": "Google", "platforms": "windows", "short_description": "Google Earth VR lets you explore the world from totally new perspectives in virtual reality. Stroll the streets of Tokyo, soar over the Grand Canyon, or walk around the Eiffel Tower."}, {"appid": 261180, "name": "Lethal League", "release_date": "2014-08-27", "developer": "Team Reptile", "platforms": "windows;mac;linux", "short_description": "Lethal League is a competitive projectile fighting game where you have to hit an anti-gravity ball into the face of your opponent to win. The ball speeds up with every strike, up to explosively extreme velocities. Play intense local matches with friends and foes, challenge yourself in the singleplayer mode or battle it out online."}, {"appid": 40700, "name": "Machinarium", "release_date": "2009-10-16", "developer": "Amanita Design", "platforms": "windows;mac", "short_description": "Machinarium is the award-winning independent adventure game developed by the makers of Samorost series, Botanicula and CHUCHEL. Help Josef the robot save his girlfriend Berta kidnapped by the Black Cap Brotherhood gang!"}, {"appid": 32390, "name": "STAR WARS™ Jedi Knight - Mysteries of the Sith™", "release_date": "2009-09-16", "developer": "LucasArts", "platforms": "windows", "short_description": "It is five years after Kyle's victory over the seven dark Jedi. Invading Imperial forces advance upon a quiet Rebel outpost, interrupting Kyle's training of a brave new Jedi, Mara Jade. First introduced in Timothy Zahn's award-winning Star Wars novel, Heir to the Empire, Mara Jade blends her past experiences as a one time smuggler and..."}, {"appid": 39200, "name": "Dungeon Siege II", "release_date": "2005-08-16", "developer": "Gas Powered Games", "platforms": "windows", "short_description": "It’s been a generation since you vanquished the evil that plagued the Land of Ehb, and now…a new menace has awakened. In Dungeon Siege II, the sequel to the best-selling RPG from Gas Powered Games, you will be called on to again wield sword and spell to save the world from a growing abomination many years in the making."}, {"appid": 263060, "name": "Blockstorm", "release_date": "2015-05-21", "developer": "GhostShark", "platforms": "windows;mac;linux", "short_description": "Blockstorm is a FPS game set in a world made of destructible blocks. All maps and characters included in the game are made with the same tools that are available to the public. You can build everything in Blockstorm, and you can destroy it."}, {"appid": 65780, "name": "ARMA: Gold Edition", "release_date": "2011-07-13", "developer": "Bohemia Interactive", "platforms": "windows", "short_description": "ARMA: Gold is pack of ARMA: Armed Assault and an expansion pack ARMA: Queen's Gambit. ARMA is a first person tactical military shooter with large elements of realism and simulation. This game features a blend of large-scale military conflict spread over large areas alongside the more closed quarters battle."}, {"appid": 404410, "name": "Endless Sky", "release_date": "2015-10-30", "developer": "Michael Zahniser", "platforms": "windows;mac;linux", "short_description": "Endless Sky is a 2D space trading and combat game inspired by the classic Escape Velocity series. Work your way up from a relatively wimpy shuttle, cargo ship, or fighter, to a highly upgraded and customized flagship or to a massive fleet of warships or freighters."}, {"appid": 508440, "name": "Totally Accurate Battle Simulator", "release_date": "2019-04-01", "developer": "Landfall", "platforms": "windows;mac", "short_description": "Totally Accurate Battle Simulator is a wacky physics-based tactics game. Experience accurate warfare through the ages. TABS uses state of the art physics-based simulation to provide you with never-before-seen insight to our greatest battles of history."}, {"appid": 350080, "name": "Wolfenstein: The Old Blood", "release_date": "2015-05-04", "developer": "MachineGames", "platforms": "windows", "short_description": "Wolfenstein®: The Old Blood™ is a standalone prequel to the critically acclaimed first-person action-adventure shooter, Wolfenstein®: The New Order. This adventure spans eight chapters and features the hallmarks of MachineGames – thrilling action, immersive story, and intense FPS combat."}, {"appid": 657200, "name": "Hand Simulator", "release_date": "2017-07-18", "developer": "HFM Games", "platforms": "windows", "short_description": "There are many different levels where you can play with spinners, plunge into the subtleties of handling weapons, milk a cow, take part in a Mexican duel with your friends, have a good time fishing, play chess or simply chat in an anonymous club."}, {"appid": 39150, "name": "FINAL FANTASY VIII", "release_date": "2013-12-05", "developer": "Square Enix", "platforms": "windows", "short_description": "It is a time of war. Galbadia, a Global Superpower, has declared war on Dollet, a country whose training academy is home to two personalities: the hot-headed Seifer and the 'lone wolf', Squall Leonhart. Both are equally at conflict with each other as their country is with Galbadia; to others, Squall appears lacking in team spirit, while..."}, {"appid": 314280, "name": "The Forgotten Ones", "release_date": "2014-07-17", "developer": "Bernt Andreas Eide", "platforms": "windows;mac;linux", "short_description": "Losing his parents during the holocaust to a mad man of a doctor. You're to play as Grobuskna Vladinov, 20 years after the incident that changed his life dramatically. Grobuskna receives an unknown phone call that'll start a journey that'll twist your mind..."}, {"appid": 766570, "name": "Russian Fishing 4", "release_date": "2018-06-15", "developer": "Russian Fishing", "platforms": "windows", "short_description": "Russian Fishing 4 is a fishing simulator with RPG elements. There is no story line and the whole process is based on the concept of an open, free to roam and free to play game."}, {"appid": 39500, "name": "Gothic® 3", "release_date": "2009-12-02", "developer": "Piranha Bytes", "platforms": "windows", "short_description": "A nameless hero becomes a legend! Myrtana, a world in upheaval: overrun by orcs from the dark lands in the north, King Rhobar is defending Vengard, the former stronghold of the humans, with his last troop of followers."}, {"appid": 64000, "name": "Men of War: Assault Squad", "release_date": "2011-02-24", "developer": "Digitalmindsoft", "platforms": "windows", "short_description": "Men of War: Assault Squad features a completely new cooperative skirmish game mode with access to five different nations (Russia, Germany, USA, Commonwealth and, for the first time ever in the Men of War series, Japan) as well as increased realism and accessibility."}, {"appid": 448510, "name": "Overcooked", "release_date": "2016-08-03", "developer": "Ghost Town Games Ltd.", "platforms": "windows", "short_description": "Overcooked is a chaotic couch co-op cooking game for one to four players. Working as a team, you and your fellow chefs must prepare, cook and serve up a variety of tasty orders before the baying customers storm out in a huff."}, {"appid": 39650, "name": "The Guild II", "release_date": "2010-06-24", "developer": "4 Head Studios", "platforms": "windows", "short_description": "The Guild 2 is the shining successor of the ultra successful medieval life sim, Europe 1400. The Guild 2 is a unique mixture of RPG and life simulation in an immersive middle ages scenario. The player and his party become part of history and can even change it in real-time. Go back to the dark middle ages and found a new dynasty!"}, {"appid": 63710, "name": "BIT.TRIP RUNNER", "release_date": "2011-02-28", "developer": "Gaijin Games", "platforms": "windows;mac", "short_description": "CommanderVideo is back with BIT.TRIP RUNNER, the latest chapter on Steam in the award-winning and critically acclaimed BIT.TRIP series. Launch special: 10% off now thru Mar. 6th!"}, {"appid": 40300, "name": "Risen", "release_date": "2009-10-02", "developer": "Piranha Bytes", "platforms": "windows", "short_description": "The island Faranga needs a new hero, you! Delve into a gritty, raw and atmospheric fantasy world in which every action has a consequence. In the epic world of Risen, filled with mysterious earthquakes, fearsome monsters and unimaginable treasures, forge your path with the sword, learn the art of staff fighting or become a powerful mage."}, {"appid": 440900, "name": "Conan Exiles", "release_date": "2018-05-08", "developer": "Funcom", "platforms": "windows", "short_description": "An online multiplayer survival game set in the lands of Conan the Barbarian. Survive in a vast open world sandbox, build a home and kingdom, dominate your enemies in single or multiplayer."}, {"appid": 253030, "name": "Race The Sun", "release_date": "2013-12-09", "developer": "Flippfly LLC", "platforms": "windows;mac;linux", "short_description": "You are a solar-powered craft. The sun is your death timer. Hurtle towards the sunset at breakneck speed in a futile race against time. Delay the inevitable by catching speed boosts which reverse the setting sun - if only for a moment."}, {"appid": 319510, "name": "Five Nights at Freddy's", "release_date": "2014-08-19", "developer": "Scott Cawthon", "platforms": "windows", "short_description": "Welcome to your new summer job at Freddy Fazbear's Pizza, where kids and parents alike come for entertainment and food! The main attraction is Freddy Fazbear, of course; and his two friends. They are animatronic robots, programmed to please the crowds!"}, {"appid": 447040, "name": "Watch_Dogs® 2", "release_date": "2016-11-28", "developer": "Ubisoft", "platforms": "windows", "short_description": "Welcome to San Francisco. Play as Marcus, a brilliant young hacker, and join the most notorious hacker group, DedSec. Your objective: execute the biggest hack of history."}, {"appid": 318600, "name": "The Flame in the Flood", "release_date": "2016-02-24", "developer": "The Molasses Flood", "platforms": "windows;mac", "short_description": "A rogue-lite river journey through the backwaters of a forgotten post-societal America. Forage, craft, evade predators."}, {"appid": 46500, "name": "Syberia", "release_date": "2011-05-19", "developer": "Microids", "platforms": "windows;mac", "short_description": "Join Kate Walker as she travels to remote locations and time periods in this timeless voyage to discover her true destiny."}, {"appid": 46510, "name": "Syberia II", "release_date": "2011-05-19", "developer": "Microids", "platforms": "windows;mac", "short_description": "Having searched Eastern and Western Europe for a missing heir, Kate Walker finally completed her long and arduous journey, obtaining the signature of Hans Voralberg and closing the automaton factory buyout. Mission accomplished?"}, {"appid": 49600, "name": "Beat Hazard", "release_date": "2010-04-15", "developer": "Cold Beam Games", "platforms": "windows;mac;linux", "short_description": "Experience your music collection like never before with this intense music driven arcade shooter. Each of your songs will have its own unique ebb and flow based on the music."}, {"appid": 254080, "name": "World War III: Black Gold", "release_date": "2013-09-27", "developer": "Reality Pump", "platforms": "windows;mac", "short_description": "Actual Armies. Actual Weapons. Actual Political Issues.World War III - Black Gold takes the player to the near future. The political crisis has been going on for months, leading to worldwide turmoil. A secret conference of the UN Central Geological Commission reveals that worldwide oil reserves have reached dangerously low levels: Oil..."}, {"appid": 257350, "name": "Baldur's Gate II: Enhanced Edition", "release_date": "2013-11-15", "developer": "Beamdog", "platforms": "windows;mac;linux", "short_description": "Can you resist the evil in your blood and forsake the dark destiny that awaits you? Or will you embrace your monstrous nature and ascend to godhood as the new Lord of Murder?"}, {"appid": 443810, "name": "This Is the Police", "release_date": "2016-08-02", "developer": "Weappy Studio", "platforms": "windows;mac;linux", "short_description": "This Is the Police is a strategy/adventure game set in a city spiraling the drain. Taking the role of gritty Police Chief Jack Boyd, you'll dive into a deep story of crime and intrigue. Will Jack reach his retirement with a nice stack of bills, or will he end up broken ... or worse?"}, {"appid": 317470, "name": "Cubic Castles", "release_date": "2014-08-13", "developer": "Cosmic Cow LLC", "platforms": "windows", "short_description": "Your blocks, your castle, your world!Build anything you can dream up and explore with other players! Cubic Castles is a mini-MMO that combines the best of block-building and 3D platform action! Create fantastic parkour challenges, explore worlds made by other players, or even make new friends- the only limit is your imagination."}, {"appid": 346940, "name": "Shadowrun: Hong Kong - Extended Edition", "release_date": "2015-08-20", "developer": "Harebrained Schemes", "platforms": "windows;mac;linux", "short_description": "Shadowrun: Hong Kong - Extended Edition is the capstone title in Harebrained Schemes' Shadowrun series - and now includes the all-new, 6+ hr Shadows of Hong Kong Bonus Campaign. Experience the most impressive Shadowrun RPG yet, hailed as one of the best cRPG / strategy games of 2015!"}, {"appid": 447020, "name": "Farming Simulator 17", "release_date": "2016-10-24", "developer": "Giants Software", "platforms": "windows;mac", "short_description": "Take on the role of a modern farmer in Farming Simulator 17! Explore farming possibilities in a new North American environment. Drive over 250 farming vehicles and equipment from over 75 manufacturers, including new brands such as Challenger, Fendt, Valtra or Massey Ferguson."}, {"appid": 256290, "name": "Child of Light", "release_date": "2014-04-29", "developer": "Ubisoft Montréal", "platforms": "windows", "short_description": "Aurora, a young girl from 1895 Austria, awakens on the lost fairytale continent of Lemuria. To return home she must fight against the dark creatures of the Queen of the Night, who have stolen the sun, the moon and the stars. At stake is not only Lemuria, but Aurora’s true destiny."}, {"appid": 48240, "name": "Anno 2070™", "release_date": "2011-11-17", "developer": "Blue Byte;Related Designs", "platforms": "windows", "short_description": "Build your society of the future, colonize islands, and create sprawling megacities with multitudes of buildings, vehicles, and resources to manage."}, {"appid": 48190, "name": "Assassin’s Creed® Brotherhood", "release_date": "2011-03-17", "developer": "Ubisoft Montreal", "platforms": "windows", "short_description": "Now Available on Mac! It’s time to join the Brotherhood."}, {"appid": 254700, "name": "resident evil 4 / biohazard 4", "release_date": "2014-02-27", "developer": "Capcom", "platforms": "windows", "short_description": "Special agent Leon S. Kennedy is sent on a mission to rescue the U.S. President’s daughter who has been kidnapped."}, {"appid": 47400, "name": "Stronghold 3 Gold", "release_date": "2012-05-25", "developer": "FireFly Studios", "platforms": "windows;mac;linux", "short_description": "Set 10 years after the original, Stronghold 3: Gold follows the vengeful story of The Wolf in the third installment of the award-winning castle building series. The Wolf has cheated death become even more bitter and twisted. Build castles, rally your troops and save medieval England!"}, {"appid": 400240, "name": "The Deer", "release_date": "2016-03-28", "developer": "Fabio Ferrara;Giulia Airoldi", "platforms": "windows;mac;linux", "short_description": "&quot;The Deer&quot; is an educational inter­ac­tive expe­ri­ence for children.You'll be an ancient Deer during the Pleistocene (Ice Age) epoch and you'll discover everything about this marvelous era.Unfortunately there were no T-Rex during this age since they were already extinct millions of years before."}, {"appid": 400250, "name": "Heaven Island - VR MMO", "release_date": "2015-12-23", "developer": "Fabio Ferrara;Giulia Airoldi", "platforms": "windows;mac;linux", "short_description": "More a Journey in your Inner Self than a game, &quot;Heaven Island&quot; is an experience in which you'll explore wonderful places. The inspiration for the environments comes from the Renzo Piano designs and from the book &quot;Origins of Architectural Pleasure&quot; in which the welfare is of primary importance."}, {"appid": 257730, "name": "Infinity Wars: Animated Trading Card Game", "release_date": "2014-09-05", "developer": "Lightmare Studios", "platforms": "windows;mac", "short_description": "Infinity Wars is a genuine free-to-play trading card game. Play with fully animated cards in 3D battlefields, and assemble decks from over 800 cards and 8 stylized factions. Explore the strategic depth of simultaneous gameplay and compete in a number of PvP game modes and an extensive PvE campaign."}, {"appid": 257750, "name": "Bloody Trapland", "release_date": "2013-11-18", "developer": "2Play", "platforms": "windows", "short_description": "Bloody Trapland is a fast-paced multiplayer platformer where the levels are filled with dozens of dangerous traps and tricky jumps that stand in your way! Play co-op with your friends or take on the challenges on your own. With support for up to 4 players at once, local and/or online."}, {"appid": 254060, "name": "KnightShift", "release_date": "2013-09-27", "developer": "Reality Pump", "platforms": "windows;mac", "short_description": "Do you like Real Time Strategy? or are Role Playing Games your preference…Why not try both genres in one? … or even both separately? …In one game: KnightShift!In a mystical world beyond fantasy and imagination, where corruption and disaster go hand in hand, not all is as it seems."}, {"appid": 316790, "name": "Grim Fandango Remastered", "release_date": "2015-01-26", "developer": "Double Fine Productions", "platforms": "windows;mac;linux", "short_description": "One of the most acclaimed adventure games of all time is now back, better than ever. Grim Fandango Remastered has the all the beautiful art and engaging story fans remember, but has also been remastered to look, sound, and control even better than the award-winning original release."}, {"appid": 767560, "name": "War Robots", "release_date": "2018-04-04", "developer": "Pixonic", "platforms": "windows", "short_description": "War Robots is an online third-person 6v6 PvP shooter—we’re talking dozens of combat robots, hundreds of weapons combinations, and heated clan battles."}, {"appid": 259130, "name": "Wasteland 1 - The Original Classic", "release_date": "2013-11-13", "developer": "inXile Entertainment", "platforms": "windows;mac;linux", "short_description": "For the first time in over 20 years, we are heralding the return of a much loved piece of gaming history with the classic RPG, Wasteland! Mutants. Again. Even more than there were last time: they seem to materialize out of the very grains of the radioactive desert sand. Venomous yellow eyes."}, {"appid": 347560, "name": "Terra Incognita ~ Chapter One: The Descendant", "release_date": "2015-02-03", "developer": "Back To Basics Gaming", "platforms": "windows", "short_description": "Terra Incognita is a classic role playing game. The world of Terra is slowly falling into chaos. A great war is coming and It's time to take up arms against a corrupt royal family. You must travel across this huge world and unite the nations of Terra, recruiting comrades along the way."}, {"appid": 258970, "name": "Gauntlet™ Slayer Edition", "release_date": "2014-09-23", "developer": "Arrowhead Game Studios", "platforms": "windows", "short_description": "The classic Gauntlet 4-player co-op action gameplay returns in a completely new experience! Battle the endless hordes of foes as you and your friends fight for treasure and glory via both local and online co-op multiplayer. Invade the Darkness!"}, {"appid": 345920, "name": "The Note", "release_date": "2015-07-23", "developer": "ArtemizGame", "platforms": "windows", "short_description": "The Note - Game where you have to find a friend."}, {"appid": 45740, "name": "Dead Rising® 2", "release_date": "2010-09-27", "developer": "Capcom Vancouver", "platforms": "windows", "short_description": "The sequel to the million-plus selling Dead Rising, Dead Rising 2 takes the zombie survival horror to Fortune City, America’s latest and greatest entertainment playground."}, {"appid": 45760, "name": "Ultra Street Fighter® IV", "release_date": "2014-08-07", "developer": "Capcom", "platforms": "windows", "short_description": "The world’s greatest fighting game evolves to a whole new level with Ultra Street Fighter IV."}, {"appid": 446150, "name": "GUNS UP!", "release_date": "2018-02-05", "developer": "Valkyrie Entertainment, LLC", "platforms": "windows", "short_description": "GUNS UP! is a free-to-play side-scrolling strategy game that pits players against each other in a battle to destroy enemy bases to increase their own army’s strength. GUNS UP! combines the fun of enemy base invasion with tower–defense, for an experience like no other!"}, {"appid": 258760, "name": "Scania Truck Driving Simulator", "release_date": "2014-02-27", "developer": "SCS Software", "platforms": "windows", "short_description": "Get behind the wheel of one of the most iconic trucks on the road with this highly detailed Scania R-series truck simulation by SCS Software, developers of Euro Truck Simulator 2.Prove your truck skills - Put your driving skills to the ultimate test with 10 individual truck maneuvering challenges that serve as a practical exam as you..."}, {"appid": 258520, "name": "The Vanishing of Ethan Carter", "release_date": "2014-09-25", "developer": "The Astronauts", "platforms": "windows", "short_description": "The Vanishing of Ethan Carter is a first-person story-driven mystery. Purchase this game to get both the original and the Unreal Engine 4 remaster called The Vanishing of Ethan Carter Redux."}, {"appid": 346120, "name": "Boring Man - Online Tactical Stickman Combat", "release_date": "2015-02-20", "developer": "Spasman Games", "platforms": "windows", "short_description": "Battle other 2D stickman online while jumping around like a lunatic and getting blown up into smithereens. With 70 weapons, Boring Man is the most chaotic and hilarious 2D online shooter on the internet. Customize game modes with highly flexible options and crazy mutators!"}, {"appid": 258180, "name": "Deus Ex: The Fall", "release_date": "2014-03-17", "developer": "Square Enix", "platforms": "windows", "short_description": "OVERVIEW:Deus Ex: The Fall is set in 2027– a golden era for science, technology and human augmentation, but also a time of great social divide and global conspiracy. Powerful corporations have seized control from governments and command the drug supply needed by augmented humans to survive."}, {"appid": 696370, "name": "BROKE PROTOCOL: Online City RPG", "release_date": "2017-08-26", "developer": "Cylinder Studios", "platforms": "windows", "short_description": "Become the Most Successful (or Most Wanted) man in the city. Broke Protocol is a low-poly open-world action game with a strong focus on roleplaying features. You define your own goals and identity in a persistent, interactive, and reactive online sandbox. Currently in Early Access."}, {"appid": 253900, "name": "Knights and Merchants", "release_date": "2013-10-14", "developer": "Topware Interactive", "platforms": "windows;mac;linux", "short_description": "KNIGHTS and MERCHANTS recreates the era of the Middle Ages. Apart from the purely fictitious geography of our world, all game elements and scenes are based on the Anglo-Saxon period, 1200 A.D. And we haven't used imaginary elements like fabled creatures, either. The player takes on the role of an ordinary captain in the Palace Guard."}, {"appid": 257850, "name": "Hyper Light Drifter", "release_date": "2016-03-31", "developer": "Heart Machine", "platforms": "windows;mac;linux", "short_description": "Explore a beautiful, vast and ruined world riddled with dangers and lost technologies."}, {"appid": 38420, "name": "Fallout Tactics: Brotherhood of Steel", "release_date": "2009-08-19", "developer": "14° East", "platforms": "windows", "short_description": "Tactical Squad-Based Combat comes to the Fallout® Universe! You are the wretched refuse. You may be born from dirt, but we will forge you into steel. You will learn to bend; if not you, will you break. In these dark times, the Brotherhood - your Brotherhood - is all that stands between the rekindled flame of civilization and the howling,..."}, {"appid": 394510, "name": "HELLDIVERS™ A New Hell Edition", "release_date": "2015-12-07", "developer": "Arrowhead Game Studios", "platforms": "windows", "short_description": "HELLDIVERS™ is a hardcore, cooperative, twin stick shooter. As part of the elite unit called the HELLDIVERS, players must work together to protect SUPER EARTH and defeat the enemies of mankind in an intense intergalactic war."}, {"appid": 394310, "name": "Punch Club", "release_date": "2016-01-08", "developer": "Lazy Bear Games", "platforms": "windows;mac;linux", "short_description": "Train hard, fight crocodiles and find love. Earn your place in the Punch Club ranks, and discover who brutally murdered your father, in this choose your own adventure boxing management tycoon."}, {"appid": 266430, "name": "Anarchy Arcade", "release_date": "2014-09-03", "developer": "Elijah Newman-Gomez", "platforms": "windows", "short_description": "Turn your entire digital life into a game. AArcade is a 3D desktop that launches shortcuts to absolutely anything you like. Join the anarchy of the persistent online metaverse, or remain in your own private reality. Casual in-game building features, plus hundreds of thousands of addons."}, {"appid": 637650, "name": "FINAL FANTASY XV WINDOWS EDITION", "release_date": "2018-03-06", "developer": "Square Enix", "platforms": "windows", "short_description": "Take the journey, now in ultimate quality. Boasting a wealth of bonus content and supporting ultra high-resolution graphical options and HDR 10, you can now enjoy the beautiful and carefully-crafted experience of FINAL FANTASY XV like never before."}, {"appid": 627690, "name": "Idle Champions of the Forgotten Realms", "release_date": "2017-09-07", "developer": "Codename Entertainment Inc.", "platforms": "windows;mac", "short_description": "Idle Champions of the Forgotten Realms is a Dungeons &amp; Dragons strategy video game that brings together D&amp;D characters from novels, adventures, and multiple live streams into a single grand adventure."}, {"appid": 267490, "name": "Batman™: Arkham Origins Blackgate - Deluxe Edition", "release_date": "2014-04-01", "developer": "Armature Studio", "platforms": "windows", "short_description": "Batman: Arkham Origins Blackgate - Deluxe Edition amplifies the 2.5-D game developed by Armature Studio with new maps, enemy encounters, difficulty levels, and batsuits, all with enhanced visuals. A companion game to Batman: Arkham Origins, players can continue the storyline of the console version and discover more details of the Dark..."}, {"appid": 94400, "name": "Nidhogg", "release_date": "2014-01-13", "developer": "Messhof", "platforms": "windows;mac", "short_description": "Nidhogg is the epic award-winning fencing tug-of-war, full of graceful acrobatics and clumsy stabs. IRL yelling and excitement may occur, in this ultimate two-player showdown of fast-paced fencing and melee attacks. Beware, advantages in Nidhogg are often fleeting, as new opponents continually spawn in your way."}, {"appid": 246900, "name": "Viscera Cleanup Detail", "release_date": "2015-10-23", "developer": "RuneStorm", "platforms": "windows;mac", "short_description": "In Viscera Cleanup Detail, you step into the boots of a space-station janitor tasked with cleaning up after various horrific sci-fi horror events. Instead of machineguns and plasma-rifles, your tools are a mop and bucket. That hero left a mess, and it's up to you to deal with the aftermath."}, {"appid": 94200, "name": "Jamestown", "release_date": "2011-06-08", "developer": "Final Form Games", "platforms": "windows;mac", "short_description": "Jamestown: Legend Of The Lost Colony is a neo-classical top-down shooter for up to 4 players, set on 17th-century British Colonial Mars. It features all the intensity, depth, and lovingly handcrafted pixels of a classic arcade shooter, with a modern twist: deeply-integrated cooperative gameplay."}, {"appid": 266510, "name": "Hand of Fate", "release_date": "2015-02-17", "developer": "Defiant Development", "platforms": "windows;mac;linux", "short_description": "Deckbuilding comes to life in Hand of Fate! An infinitely replayable series of quests - earn new cards, build your deck, then try to defeat it! In a cabin at the end of the world, the game of life and death is played. Draw your cards, play your hand, and discover your fate."}, {"appid": 92800, "name": "SpaceChem", "release_date": "2011-03-02", "developer": "Zachtronics", "platforms": "windows;mac;linux", "short_description": "Zachtronics is back with an ambitious new design-based puzzle game. Take on the role of a Reactor Engineer working for SpaceChem, the leading chemical synthesizer for frontier colonies. Construct elaborate factories to transform raw materials into valuable chemical products!"}, {"appid": 91200, "name": "Anomaly: Warzone Earth", "release_date": "2011-04-08", "developer": "11 bit studios", "platforms": "windows;mac;linux", "short_description": "Lead an armored squad through the perils of this reversed tower defense action-strategy game!"}, {"appid": 637090, "name": "BATTLETECH", "release_date": "2018-04-24", "developer": "Harebrained Schemes", "platforms": "windows;mac;linux", "short_description": "Take command of your own mercenary outfit of 'Mechs and the MechWarriors that pilot them, struggling to stay afloat as you find yourself drawn into a brutal interstellar civil war."}, {"appid": 450390, "name": "The Lab", "release_date": "2016-04-05", "developer": "Valve", "platforms": "windows", "short_description": "Welcome to The Lab, a compilation of Valve’s room-scale VR experiments set in a pocket universe within Aperture Science. Fix a robot, defend a castle, adopt a mechanical dog, and more. Still not sold? It’s free!"}, {"appid": 34010, "name": "Alpha Protocol™", "release_date": "2010-05-27", "developer": "Obsidian Entertainment", "platforms": "windows", "short_description": "Loyalty carries a price and no one knows this more than agent Michael Thorton. A talented young agent cast out by his government, Thorton is the only one with the information needed to stop an impending international catastrophe. To do so means he must cut himself off from the very people he is sworn to protect."}, {"appid": 247430, "name": "Hitman: Contracts", "release_date": "2014-01-21", "developer": "Io-Interactive A/S", "platforms": "windows", "short_description": "Enter the world of a HITMAN - a world of crime, sin and greed. Delve into the mind of Agent 47 and encounter his greatest adversaries, completing the work that made him so brutally efficient and shaped him as an assassin. Eliminate your targets by any means necessary. There are no rules... only the contract, signed in blood."}, {"appid": 247730, "name": "Nether: Resurrected", "release_date": "2014-06-05", "developer": "Phosphor Games Studio", "platforms": "windows", "short_description": "Nether is a unique, first-person, multiplayer urban survival experience. Set in a post-apocalyptic world, Nether forces players to make life-saving decisions in a fast-paced struggle against players and the environment. Join tribes, hold territory, scavenge, craft, trade and loot your way to stay alive."}, {"appid": 312530, "name": "Duck Game", "release_date": "2015-06-04", "developer": "Landon Podbielski", "platforms": "windows", "short_description": "Enter the futuristic year of 1984, an age where ducks run wild in a frantic battle for glory. Blast your friends with Shotguns, Net Guns, Mind Control Rays, Saxophones, Magnet Guns, and much, much more. This is DUCK GAME. Don't blink."}, {"appid": 437900, "name": "Party Jousting", "release_date": "2016-03-01", "developer": "vikingfabian.com", "platforms": "windows", "short_description": "A one-button party game for 2-16 players, sharing a keyboard or controller."}, {"appid": 390670, "name": "Steel Ocean", "release_date": "2015-11-12", "developer": "ICE Entertainment", "platforms": "windows", "short_description": "It is a free-to-play shooting game.You may choose 6 types of warships used in the WWII to play PvP and PvE naval battle. Start the voyage with your warships and fight for the honor of your fleet!"}, {"appid": 353130, "name": "Time of Dragons", "release_date": "2016-02-01", "developer": "4 I Lab", "platforms": "windows;mac;linux", "short_description": "This is an MMO shooter where you ride dragons armed with missiles and lasers!"}, {"appid": 311730, "name": "DEAD OR ALIVE 5 Last Round: Core Fighters", "release_date": "2015-03-30", "developer": "Team NINJA;KOEI TECMO GAMES CO., LTD.", "platforms": "windows", "short_description": "The free version of the final word in fighting entertainment - DEAD OR ALIVE 5 Last Round!"}, {"appid": 268050, "name": "The Evil Within", "release_date": "2014-10-13", "developer": "Tango Gameworks", "platforms": "windows", "short_description": "Developed by Shinji Mikami -- creator of the seminal Resident Evil series -- and the talented team at Tango Gameworks, The Evil Within embodies the meaning of pure survival horror. Highly-crafted environments, horrifying anxiety, and an intricate story are combined to create an immersive world that will bring you to the height of tension."}, {"appid": 98400, "name": "Hard Reset Extended Edition", "release_date": "2012-07-12", "developer": "Flying Wild Hog", "platforms": "windows", "short_description": "Over-the-top destruction, loads of enemies &amp; a beautifully realized cyberpunk setting. Hard Reset is here to shake up the shooter scene. Try the demo now."}, {"appid": 32420, "name": "STAR WARS™: The Clone Wars - Republic Heroes™", "release_date": "2009-10-06", "developer": "Krome Studios", "platforms": "windows", "short_description": "Star Wars The Clone Wars: Republic Heroes lets Star Wars fans young and old live out the sweeping galactic adventures of the Clone Wars. For the first time ever, players can fight as their favorite Jedi and Clone Troopers from the preeminent animated television..."}, {"appid": 32440, "name": "LEGO® Star Wars™ - The Complete Saga", "release_date": "2009-11-12", "developer": "Traveller's Tales;Feral Interactive (Mac)", "platforms": "windows;mac", "short_description": "Kick Some Brick in I through VI! Play through all six Star Wars movies in one videogame! Adding new characters, new levels, new features and for the first time ever, the chance to build and battle your way through a fun Star Wars galaxy on your PC!"}, {"appid": 98200, "name": "Frozen Synapse", "release_date": "2011-05-26", "developer": "Mode 7", "platforms": "windows;mac;linux", "short_description": "Brings the simultaneous turn-based strategy genre up-to-date and lets you give detailed, accurate orders to your squad."}, {"appid": 341800, "name": "Keep Talking and Nobody Explodes", "release_date": "2015-10-08", "developer": "Steel Crate Games", "platforms": "windows;mac;linux", "short_description": "Find yourself trapped alone in a room with a ticking time bomb. Your friends have the manual to defuse it, but they can't see the bomb, so you're going to have to talk it out – fast!"}, {"appid": 310950, "name": "Street Fighter V", "release_date": "2016-02-15", "developer": "Capcom", "platforms": "windows", "short_description": "Experience the intensity of head-to-head battles with Street Fighter® V! Choose from 16 iconic characters, then battle against friends online or offline with a robust variety of match options."}, {"appid": 495910, "name": "Dungeon Fighter Online", "release_date": "2016-08-09", "developer": "Neople", "platforms": "windows", "short_description": "Get ready for the ultimate brawl! Dungeon Fighter Online is a classic beat-em up 2D action game with an epic storyline and RPG elements! Choose from 14 diverse classes, and unravel ancient mysteries as you punch, slash, shoot, or summon your way to victory!"}, {"appid": 268870, "name": "Satellite Reign", "release_date": "2015-08-27", "developer": "5 Lives Studios", "platforms": "windows;mac;linux", "short_description": "Satellite Reign is a real-time, class-based strategy game, set in an open-world cyberpunk city. You command a group of 4 agents through rain-soaked, neon-lit streets, where the law is the will of mega-corporations."}, {"appid": 510840, "name": "Evolvation", "release_date": "2017-02-06", "developer": "HyperReuts", "platforms": "windows", "short_description": "Evolvation is a multiplayer fast-paced and class based space flying shooter developed by a two-man-army from Amsterdam. It is still under development but already good to play. Classes are: Highspeed, Fighter, Stealth, Support and Tank. Each class has its own special ability which provides a dynamic gameplay."}, {"appid": 323850, "name": "Move or Die", "release_date": "2016-01-21", "developer": "Those Awesome Guys", "platforms": "windows;mac;linux", "short_description": "Move or Die is an absurdly fast-paced, 4-player local and online party game where the mechanics change every 20 seconds. The very definition of a perfect friendship-ruining game."}, {"appid": 311340, "name": "METAL GEAR SOLID V: GROUND ZEROES", "release_date": "2014-12-18", "developer": "Kojima Productions", "platforms": "windows", "short_description": "World-renowned Kojima Productions brings the Metal Gear Solid franchise to Steam with METAL GEAR SOLID V: GROUND ZEROES. Play as the legendary hero Snake and infiltrate a Cuban military base to rescue the hostages. Can you make it out alive?"}, {"appid": 15100, "name": "Assassin's Creed™: Director's Cut Edition", "release_date": "2008-04-09", "developer": "Ubisoft Montreal", "platforms": "windows", "short_description": "Assassin's Creed™ is the next-gen game developed by Ubisoft Montreal that redefines the action genre. While other games claim to be next-gen with impressive graphics and physics, Assassin's Creed merges technology, game design, theme and emotions into a world where you instigate chaos and become a vulnerable, yet powerful, agent of..."}, {"appid": 496300, "name": "Kingdom: New Lands", "release_date": "2016-08-09", "developer": "Noio", "platforms": "windows;mac;linux", "short_description": "Kingdom: New Lands builds upon the award-winning gameplay and mystery of Kingdom by introducing an abundance of new content to the IGF-nominated title while maintaining the simplicity and depth that legions of monarchs have come to experience and enjoy."}, {"appid": 389730, "name": "TEKKEN 7", "release_date": "2017-06-01", "developer": "BANDAI NAMCO Studios Inc.", "platforms": "windows", "short_description": "Discover the epic conclusion of the long-time clan warfare between members of the Mishima family. Powered by Unreal Engine 4, the legendary fighting game franchise fights back with stunning story-driven cinematic battles and intense duels that can be enjoyed with friends and rivals."}, {"appid": 323470, "name": "DRAGON BALL XENOVERSE", "release_date": "2015-02-26", "developer": "DIMPS", "platforms": "windows", "short_description": "DRAGON BALL XENOVERSE revisits famous battles from the series through your custom Avatar and other classic characters. New features include the mysterious Toki Toki City, new gameplay mechanics, new animations and many other amazing features!"}, {"appid": 91700, "name": "E.Y.E: Divine Cybermancy", "release_date": "2011-07-29", "developer": "Streum On Studio", "platforms": "windows", "short_description": "In a dark Cyberpunk world, you (and up to 3 friends) wage war against the all-powerful Federation in this Source-powered FPS/RPG."}, {"appid": 351970, "name": "Tales of Zestiria", "release_date": "2015-10-19", "developer": "BANDAI NAMCO Studio Inc.", "platforms": "windows", "short_description": "In a world torn by war and political skirmishes, accept the burden of the Shepherd and fight human darkness to protect your world from Malevolence and reunite humans and Seraphim."}, {"appid": 394230, "name": "Battleborn", "release_date": "2016-05-03", "developer": "Gearbox Software", "platforms": "windows", "short_description": "FREE PVP TRIAL AVAILABLE NOW! A tremendous band of badass heroes fight to protect the universe’s very last star from a mysterious evil in this Hero Shooter by the creators of Borderlands."}, {"appid": 393420, "name": "Hurtworld", "release_date": "2015-12-03", "developer": "Bankroll Studios", "platforms": "windows;mac", "short_description": "Hurtworld is a hardcore multiplayer survival FPS with a focus on competitive gunplay and strategic map control. Built for hardcore gamers, Hurtworld aims to punish."}, {"appid": 509110, "name": "Spikit", "release_date": "2016-08-09", "developer": "Blastoid Entertainment", "platforms": "windows", "short_description": "Spikit is a bullet hell game developed by a single developer, Igor Petrović. With a soundtrack composed by Dario Malešević. In this game, the player will have to dodge a constant barrage of spikes coming from the side of the screen."}, {"appid": 250180, "name": "METAL SLUG 3", "release_date": "2014-02-14", "developer": "SNK CORPORATION;DotEmu", "platforms": "windows", "short_description": "“METAL SLUG 3”, the masterpiece in SNK’s emblematic 2D run &amp; gun action shooting game series, still continues to fascinate millions of fans worldwide to this day for its intricate dot-pixel graphics, and simple and intuitive game controls!"}, {"appid": 343360, "name": "Particula", "release_date": "2015-02-02", "developer": "Microblast Games", "platforms": "windows;mac", "short_description": "Destroy negativity, clear your mind! Particula brings you a new perspective in gaming, helping you to concentrate and relax. A three players co-op tower defense experience with a relaxing soundtrack, smooth visuals and gameplay."}, {"appid": 787860, "name": "Farming Simulator 19", "release_date": "2018-11-19", "developer": "Giants Software", "platforms": "windows;mac", "short_description": "The best-selling franchise takes a giant leap forward with a complete overhaul of the graphics engine, offering the most striking and immersive visuals and effects, along with the deepest and most complete farming experience ever."}, {"appid": 393380, "name": "Squad", "release_date": "2015-12-14", "developer": "Offworld Industries", "platforms": "windows", "short_description": "Squad is a tactical FPS that provides authentic combat experiences through teamwork, communication, and gameplay. It seeks to bridge the large gap between arcade shooter and military simulation. Large scale, combined arms combat, base building, and a great integrated VoIP system."}, {"appid": 313730, "name": "Sunrider: Mask of Arcadius", "release_date": "2014-07-09", "developer": "Love in Space", "platforms": "windows;mac;linux", "short_description": "As Captain Kayto Shields, embark on a galactic voyage of heroism and survival. With his home world destroyed and his nation conquered, the inexperienced Captain Shields, and his newly minted vessel, the Sunrider, are left as the only hope against a galactic evil intent on subjugating all sentient life."}, {"appid": 250420, "name": "8BitMMO", "release_date": "2015-01-26", "developer": "Archive Entertainment", "platforms": "windows;mac;linux", "short_description": "8BitMMO is a retro-style 2D massively multiplayer game! It's a giant construction sandbox -- you can build a home or a castle in a persistent streaming world. Found and manage your own city. Fight evil LawyerCats and engage in Player vs Player battle."}, {"appid": 70600, "name": "Worms Ultimate Mayhem", "release_date": "2011-09-28", "developer": "Team17 Digital Ltd", "platforms": "windows", "short_description": "Load your weapons and experience a whole new dimension in destructive turn-based cartoon action!"}, {"appid": 312660, "name": "Sniper Elite 4", "release_date": "2017-02-13", "developer": "Rebellion", "platforms": "windows", "short_description": "Discover unrivalled sniping freedom in the largest and most advanced World War 2 shooter ever built. Experience tactical third-person combat, gameplay choice and epic longshots across gigantic levels as you liberate wartime Italy from the grip of Fascism."}, {"appid": 263540, "name": "Villagers and Heroes", "release_date": "2014-04-17", "developer": "Mad Otter Games", "platforms": "windows", "short_description": "Welcome to a land you'll never want to leave! Villagers and Heroes is a free-to-play MMO game in which players experience not just the thrill of battling unique monsters or the satisfaction of tailoring an exquisite robe, but the pleasure of building lasting friendships within a friendly community."}, {"appid": 438740, "name": "Friday the 13th: The Game", "release_date": "2017-05-25", "developer": "IllFonic", "platforms": "windows", "short_description": "Jason is back! Jason Voorhees is unleashed and stalking the grounds of Camp Crystal Lake! Friday the 13th: The Game is one of the most highly-anticipated horror titles of all time. You will finally be able to take on the role as Jason Voorhees and Camp Crystal Lake counselors."}, {"appid": 250600, "name": "The Plan", "release_date": "2014-02-14", "developer": "Krillbite Studio", "platforms": "windows;mac;linux", "short_description": "A fly ascends to the skies, pondering the pointlessness of its brief existence. The Plan was developed as a side project by Krillbite Studio, who's currently finishing their main project Among the Sleep.&quot;Hey, You Should Play This&quot; - Patrick Klepek, Giantbomb&quot;Some may argue that The Plan isn't really a game and it..."}, {"appid": 314000, "name": "Pool Nation FX Lite", "release_date": "2015-12-07", "developer": "Cherry Pop Games", "platforms": "windows", "short_description": "Pool Nation FX, is a seriously fun Pool &amp; Snooker Sim! A visually stunning billiards simulation with the critically acclaimed POOL NATION physics engine. Play 8 Ball, 9 Ball, Snooker, Killer &amp; more, unlimited Career modes with customised difficulty levels, Trickshots, Local and Online Multiplayer, spectate live matches and feel..."}, {"appid": 250760, "name": "Shovel Knight: Treasure Trove", "release_date": "2014-06-26", "developer": "Yacht Club Games", "platforms": "windows;mac;linux", "short_description": "Shovel Knight: Treasure Trove is the full and complete edition of Shovel Knight, a sweeping classic action adventure game series with awesome gameplay, memorable characters, and an 8-bit retro aesthetic."}, {"appid": 822240, "name": "Animal Jam - Play Wild!", "release_date": "2018-12-11", "developer": "WildWorks, Inc.", "platforms": "windows", "short_description": "In Play Wild, you can become your favorite animal, collect amazing items, adopt adorable pets, and create a style to express the real you as you explore the beautiful 3D world of Jamaa!"}, {"appid": 251060, "name": "Wargame: Red Dragon", "release_date": "2014-04-17", "developer": "Eugen Systems", "platforms": "windows;mac;linux", "short_description": "The new reference in RTS at its best!The Wargame series returns to duty, larger, richer and more spectacular than ever before. In Wargame Red Dragon, you are engaged in a large-scale conflict where Western forces clash against the Communist bloc."}, {"appid": 249990, "name": "FORCED: Slightly Better Edition", "release_date": "2013-10-24", "developer": "BetaDwarf", "platforms": "windows;mac;linux", "short_description": "FORCED is a challenging 1-4-player game with co-op at its heart! A mix of tactical arcade action, RPG elements and puzzles will forge you and your friends together. As slaves in the toughest gladiator school of them all, you will face a plethora of unique trials - designed to be your death!"}, {"appid": 263980, "name": "Out There Somewhere", "release_date": "2016-03-14", "developer": "MiniBoss", "platforms": "windows;mac", "short_description": "You play an explorer stranded on a dangerous alien planet. Low on fuel, your only hope for escape is to find the planet’s core in this incredibly clever action-puzzle-platformer."}, {"appid": 71340, "name": "Sonic Generations Collection", "release_date": "2011-11-03", "developer": "Devil's Details", "platforms": "windows", "short_description": "Celebrate 20 years of Sonic in an all new adventure that delivers a definitive experience to Sonic fans new and old!"}, {"appid": 313160, "name": "Farming Simulator 15", "release_date": "2014-10-30", "developer": "Giants Software", "platforms": "windows;mac", "short_description": "Welcome to the new generation of Farming Simulator!With a brand new graphics and physics engine, Farming Simulator 15 offers an immense open world, filled with details and visual effects transporting the Farming Simulator franchise to a new era."}, {"appid": 35130, "name": "Lara Croft and the Guardian of Light", "release_date": "2010-09-28", "developer": "Crystal Dynamics", "platforms": "windows", "short_description": "Take control of Lara and her new partner Totec, a Mayan tribesman, and uncover the ancient artifact known as the &quot;Mirror of Smoke&quot; in this all new action adventure game."}, {"appid": 438180, "name": "Super Mustache", "release_date": "2016-01-27", "developer": "Redro Games", "platforms": "windows", "short_description": "Super Mustache is a vintage styled platformer, filled to the brim with 8 bit pixel art juice! Join Captain Super Mustache in a journey to save the planet Uranus. If you enjoyed classic platformer games from the golden era of video games, then you’re going to love this."}, {"appid": 265550, "name": "Dead Rising 3 Apocalypse Edition", "release_date": "2014-09-05", "developer": "Capcom Game Studio Vancouver", "platforms": "windows", "short_description": "Explore the zombie-infested city of Los Perdidos, and find a way to escape before a military strike wipes the entire city, and everyone in it, off the map."}, {"appid": 248610, "name": "Door Kickers", "release_date": "2014-10-20", "developer": "KillHouse Games", "platforms": "windows;mac;linux", "short_description": "Door Kickers is an innovative realtime strategy game that puts you in charge of a SWAT team and lets you command them during a tactical intervention."}, {"appid": 265300, "name": "Lords Of The Fallen™", "release_date": "2014-10-28", "developer": "CI Games;Deck 13", "platforms": "windows", "short_description": "The Demonic Rhogar army is re-emerging from its dark realm. Harkyn, a convicted criminal rejected by society is the world’s last hope for salvation. Plunge into a fast paced action RPG using powerful magic alongside a complex and satisfying melee combat system."}, {"appid": 265210, "name": "Viscera Cleanup Detail: Santa's Rampage", "release_date": "2013-12-13", "developer": "RuneStorm", "platforms": "windows", "short_description": "Tragedy! Santa; the toy giving folk-hero, and purveyor of fine Christmas goods, has had enough. Endless requests from greedy children wanting more and more every year, tax increases, pressure from elf unions, bills, reindeer!"}, {"appid": 249050, "name": "Dungeon of the Endless™", "release_date": "2014-10-27", "developer": "AMPLITUDE Studios", "platforms": "windows;mac", "short_description": "Dungeon of the Endless is a Rogue-Like Dungeon-Defense game, in which the player and their team of heroes must protect the generator of their crashed ship while exploring an ever-expanding dungeon, all while facing waves of monsters and special events as they try to find their way out..."}, {"appid": 249130, "name": "LEGO® Marvel™ Super Heroes", "release_date": "2013-11-15", "developer": "Traveller's Tales", "platforms": "windows;mac", "short_description": "LEGO® Marvel™ Super Heroes features an original story crossing the entire Marvel Universe. Players take control of Iron Man, Spider-Man, the Hulk, Captain America, Wolverine and many more Marvel characters as they unite to stop Loki and a host of other Marvel villains from assembling a super-weapon capable of destroying the world."}, {"appid": 249230, "name": "Risen 3 - Titan Lords", "release_date": "2014-08-13", "developer": "Piranha Bytes", "platforms": "windows", "short_description": "The world has been abandoned by its gods and is scarred from the rampage of the Titans. Humanity is struggling to regain strength. You, however, have more pressing concerns: your own life has been shattered and you must set off to reclaim what is lost amidst the darkness spreading throughout the world."}, {"appid": 392110, "name": "Endless Space® 2", "release_date": "2017-05-18", "developer": "AMPLITUDE Studios", "platforms": "windows;mac", "short_description": "Endless Space 2 is a Strategic Space Opera, featuring the compelling “just one more turn” gameplay, set in the mysterious Endless universe. As the leader of your civilization, will you impose your vision and build the greatest stellar empire?"}, {"appid": 351640, "name": "Eternal Senia", "release_date": "2015-06-18", "developer": "Holy Priest", "platforms": "windows", "short_description": "Thoughts and expectations ARPG"}, {"appid": 313120, "name": "Stranded Deep", "release_date": "2015-01-23", "developer": "Beam Team Games", "platforms": "windows;mac;linux", "short_description": "Take the role of a plane crash survivor stranded somewhere in the Pacific Ocean. Come face to face with some of the most life threatening scenarios that will result in a different experience each time you play. Scavenge. Discover. Survive."}, {"appid": 249650, "name": "Blackguards", "release_date": "2014-01-22", "developer": "Daedalic Entertainment", "platforms": "windows", "short_description": "What happens when the only hope of a threatened world lies not with heroes in shining armor, but in the hands of a band of misfits and criminals? Blackguards, a new turn-based strategy RPG, explores this very question. You will discover over 180 unique hex-based battlegrounds within a dark and mature story of crime, drugs, and murder."}, {"appid": 581320, "name": "Insurgency: Sandstorm", "release_date": "2018-12-12", "developer": "New World Interactive", "platforms": "windows", "short_description": "Insurgency: Sandstorm is a team-based, tactical FPS based on lethal close quarters combat and objective-oriented multiplayer gameplay. Experience the intensity of modern combat where skill is rewarded, and teamwork wins the fight."}, {"appid": 264200, "name": "One Finger Death Punch", "release_date": "2014-03-03", "developer": "Silver Dollar Games", "platforms": "windows", "short_description": "Experience cinematic kung-fu battles in the fastest, most intense brawler the indie world has ever seen! With the unique 1:1 response system of One Finger Death Punch, players will feel the immediate feedback of every bone-crunching hit. Pay tribute to the masters using five classic kung-fu styles mixed with additional weapons."}, {"appid": 15120, "name": "Tom Clancy's Rainbow Six® Vegas 2", "release_date": "2008-04-16", "developer": "Ubisoft Montreal", "platforms": "windows", "short_description": "Tom Clancy's Rainbow Six® Vegas 2 - the sequel to the award-winning next-generation first-person shooter - returns to Sin City. Tom Clancy's Rainbow Six Vegas 2 is your last chance to rescue America's sexiest city from an escalating terrorist siege that will force you into heart-pounding action from beginning to end."}, {"appid": 20530, "name": "Red Faction", "release_date": "2009-08-05", "developer": "Volition, Inc.", "platforms": "windows", "short_description": "JOIN THE REVOLUTION! Lured to Mars by the Ultor Corporation's promise of a better life, thousands have come to seek their fortune and work for the massive mining company. But all is not as it seems. A deadly plague is sweeping through the barracks, and miners suffer daily abuse at the hands of the Ultor guards."}, {"appid": 234390, "name": "Teleglitch: Die More Edition", "release_date": "2013-07-24", "developer": "Test3 Projects", "platforms": "windows;mac;linux", "short_description": "In a cold, dark future dominated by mega-corporations, a small lonely planet on the edge of habitable space is the site of a shadowy research facility specializing in necrotic tissue reactivation. You are a scientist who has suddenly awoken to the realization that you are the lone survivor."}, {"appid": 211400, "name": "Deadlight", "release_date": "2012-10-25", "developer": "Tequila Works, S.L.", "platforms": "windows", "short_description": "“Probably the best downloadable title on the market right now.” 9/10 – Eurogamer."}, {"appid": 225320, "name": "Tomb Raider III", "release_date": "2012-11-28", "developer": "Core Design", "platforms": "windows", "short_description": "Thousands of years ago a meteor crashed into Antarctica and the shockwaves of its impact are being felt in the modern age. Lara Croft will follow clues leading to a deadly secret, boldly leaping chasms and blasting monsters that no one has leaped or blasted before. This time she faces a mystery that's from way out of this world."}, {"appid": 211600, "name": "Thief™ Gold", "release_date": "2012-05-22", "developer": "Looking Glass Studios", "platforms": "windows", "short_description": "Stalk your prey on the quest for stolen goods with your blackjack, sword, and an assortment of unique arrows. Steal for money and uncover the hidden agendas of your allies and enemies as you play through an unravelling story of deception and revenge."}, {"appid": 296470, "name": "Mount Your Friends", "release_date": "2014-07-29", "developer": "Stegersaurus Software Inc.", "platforms": "windows", "short_description": "Experience the extreme simulated sporting sensation that's sweeping our digital nation! Mount Your Friends is a fiercely competitive sporting event for you to play with your friends in the contextual security of your own home, assuming that your home is not composed of sexual innuendo."}, {"appid": 332310, "name": "LEGO® Worlds", "release_date": "2017-03-07", "developer": "TT Games;Traveller's Tales", "platforms": "windows", "short_description": "Experience a galaxy of Worlds made entirely from LEGO bricks. EXPLORE gigantic landscapes, DISCOVER countless surprises, and CREATE anything you can imagine by building with LEGO bricks."}, {"appid": 225420, "name": "Cities in Motion 2", "release_date": "2013-04-02", "developer": "Colossal Order Ltd.", "platforms": "windows;mac;linux", "short_description": "Cities in Motion 2 is the sequel to the popular mass transit simulation game Cities in Motion. Build, manage and lead your transportation network to provide cities with their ever changing needs. CIM2 introduces new features including multiplayer game modes, day and night cycles, timetables and dynamic cities."}, {"appid": 225640, "name": "Sacred 2 Gold", "release_date": "2012-12-21", "developer": "Ascaron", "platforms": "windows", "short_description": "Experience the world of Ancaria in its full glory with Sacred 2: Gold Edition. Containing Sacred 2 Fallen Angel and the awesome add-on Ice and Blood. Defeat countless dangerous enemies; capture powerful weapons and valuable treasures. Prepare yourself for the ultimate battle and become a legend."}, {"appid": 893520, "name": "Creative Destruction", "release_date": "2018-08-02", "developer": "Titan Studio", "platforms": "windows", "short_description": "Welcome to the world of Creative Destruction where everything is fully destructible! Creative Destruction is a new FPS/TPS sandbox survival game that features the utmost fun of building and firing."}, {"appid": 6370, "name": "Bloodline Champions", "release_date": "2011-10-28", "developer": "Stunlock Studios", "platforms": "windows", "short_description": "Bloodline Champions is a Free-to-Play online PvP Arena game where players engage in short, intense battles of up to ten players divided into two teams. Each player takes control over one of several bloodlines, each with their own unique weapons and abilities. Easy to learn, challenging to master."}, {"appid": 210970, "name": "The Witness", "release_date": "2016-01-26", "developer": "Thekla, Inc.", "platforms": "windows;mac", "short_description": "You wake up, alone, on a strange island full of puzzles that will challenge and surprise you."}, {"appid": 287450, "name": "Rise of Nations: Extended Edition", "release_date": "2014-06-12", "developer": "SkyBox Labs;Big Huge Games", "platforms": "windows", "short_description": "Rise of Nations is back! Play the updated classic with full Steamworks integration and enhanced features!"}, {"appid": 287290, "name": "Resident Evil Revelations 2 / Biohazard Revelations 2", "release_date": "2015-02-24", "developer": "CAPCOM Co., Ltd.", "platforms": "windows", "short_description": "RE Revelations 2 continues the series acclaimed essential survival horror experience, while uncovering startling truths."}, {"appid": 6800, "name": "Commandos: Behind Enemy Lines", "release_date": "2007-03-15", "developer": "Pyro Studios", "platforms": "windows", "short_description": "Commandos: Behind Enemy Lines is a real-time tactics game set in World War II that puts you in command of a small squad of elite troopers. Send them behind enemy lines on a series of hazardous missions, and bring them back alive. Clever strategy has never been so furiously action-packed."}, {"appid": 6810, "name": "Commandos: Beyond the Call of Duty", "release_date": "2007-03-15", "developer": "Pyro Studios", "platforms": "windows", "short_description": "You have been selected for active service in the Commandos Corps, and must now mobilize in a series of 8 new dangerous missions. You may come with experience of action 'Behind Enemy Lines' or perhaps you are just a rookie - whatever you are, you will be given the opportunity to push your daring and tactical ability to the limit."}, {"appid": 6830, "name": "Commandos 2: Men of Courage", "release_date": "2007-03-15", "developer": "Pyro Studios", "platforms": "windows", "short_description": "Commandos 2: Men of Courage is a tactical action/strategy game set against the backdrop of World War II. Take control of an elite group of commandos who must venture deep into enemy territory and utilize their combined expertise to complete a series of mission-based objectives."}, {"appid": 6840, "name": "Commandos 3: Destination Berlin", "release_date": "2007-03-15", "developer": "Pyro Studios", "platforms": "windows", "short_description": "Commandos 3: Destination Berlin is a game of real-time tactics that places you in command of an elite unit of Special Forces behind enemy lines in the European theater of World War II. From the shores of France to the heart of the Third Reich, strike fast from land or sea infiltrating hostile territories and conducting raids to disrupt..."}, {"appid": 794600, "name": "LET IT DIE", "release_date": "2018-09-26", "developer": "GRASSHOPPER MANUFACTURE INC.;SUPERTRICK  GAMES,Inc.", "platforms": "windows", "short_description": "It's finally here! The survival action game that pits the strong against the weak is finally on PC! Experience all the heart-thumping action with a silky-smooth frame rate and ultra high resolution. How you make the best of the weapons, armor, and items at your disposal will determine your fate in the ever-changing &quot;Tower of Barbs!"}, {"appid": 287920, "name": "Mortal Online", "release_date": "2015-08-31", "developer": "Star Vault AB", "platforms": "windows", "short_description": "Mortal Online is a first-person medieval fantasy MMORPG, set in a huge, open, unforgiving world. Choose your race, choose your playstyle, choose a profession, choose where to place your loyalties - if you have any..."}, {"appid": 372800, "name": "RPG MO", "release_date": "2015-08-18", "developer": "Marxnet", "platforms": "windows;mac;linux", "short_description": "RPG MO is a nostalgic MMORPG that reminds of Ultima and Runescape Classic."}, {"appid": 287980, "name": "Mini Metro", "release_date": "2015-11-06", "developer": "Dinosaur Polo Club", "platforms": "windows;mac;linux", "short_description": "Mini Metro is a strategy simulation game about designing a subway map for a growing city. Draw lines between stations and start your trains running. As new stations open, redraw your lines to keep them efficient. Decide where to use your limited resources. How long can you keep the city moving?"}, {"appid": 225300, "name": "Tomb Raider II", "release_date": "2012-11-28", "developer": "Core Design", "platforms": "windows", "short_description": "The second instalment in the Tomb Raider series invites you to join Lara as she travels around the globe to retrieve a precious artefact before it falls into the wrong hands. The legendary artefact, the Dagger of Xian, is said to give its possessor the power of a fire breathing dragon."}, {"appid": 418240, "name": "Shadow Tactics: Blades of the Shogun", "release_date": "2016-12-06", "developer": "Mimimi Productions", "platforms": "windows;mac;linux", "short_description": "Shadow Tactics is a hardcore tactical stealth game set in Japan around the Edo period. A new Shogun seizes power over Japan and enforces nationwide peace. In his battle against conspiracy and rebellion, he recruits five specialists with extraordinary skills for assassination, sabotage and espionage."}, {"appid": 295550, "name": "Royal Quest", "release_date": "2014-08-06", "developer": "Katauri", "platforms": "windows", "short_description": "Royal Quest offers a fresh MMO experience from the creators of Space Rangers and King's Bounty series. Join Guild Wars, conquer Castles, and battle other players in unique PvPvE locations, or explore the vast world of Aura and enjoy the story on your own."}, {"appid": 418070, "name": "Turbo Pug", "release_date": "2015-11-09", "developer": "Space Cat Studios;SnowFlame;Back To Basics Gaming", "platforms": "windows", "short_description": "It's time to unleash your inner pug! Turbo Pug is a casual runner with difficult, random, procedurally generated levels. Enjoy random weather and try to avoid getting zapped by lightning. Unlock new costumes for your pug and new characters to play as. Please try not to squish your pug!"}, {"appid": 466560, "name": "Northgard", "release_date": "2018-03-07", "developer": "Shiro Games", "platforms": "windows;mac;linux", "short_description": "Northgard is a strategy game based on Norse mythology in which you control a clan of Vikings vying for the control of a mysterious newfound continent."}, {"appid": 224480, "name": "Octodad: Dadliest Catch", "release_date": "2014-01-30", "developer": "Young Horses", "platforms": "windows;mac;linux", "short_description": "Octodad: Dadliest Catch is a game about destruction, deception, and fatherhood. The player controls Octodad, a dapper octopus masquerading as a human, as he goes about his life. Octodad's existence is a constant struggle, as he must master mundane tasks with his unwieldy boneless tentacles while simultaneously keeping his cephalopodan..."}, {"appid": 476600, "name": "Call of Duty®: WWII", "release_date": "2017-11-02", "developer": "Sledgehammer Games;Raven Software", "platforms": "windows", "short_description": "Call of Duty® returns to its roots with Call of Duty®: WWII - a breathtaking experience that redefines World War II for a new gaming generation."}, {"appid": 371660, "name": "Far Cry® Primal", "release_date": "2016-02-29", "developer": "Ubisoft", "platforms": "windows", "short_description": "The award-winning Far Cry franchise returns with its innovative open world gameplay, bringing together massive beasts, breathtaking environments, and unpredictable savage encounters. Welcome to the Stone Age, a time of danger and adventure."}, {"appid": 212390, "name": "Continent of the Ninth Seal", "release_date": "2012-09-13", "developer": "Cloud 9 Studio", "platforms": "windows", "short_description": "New users who start a C9 account between now and April 4th, 2013 will receive a free in-game gift."}, {"appid": 332500, "name": "GRAV", "release_date": "2015-01-08", "developer": "BitMonster, Inc.", "platforms": "windows", "short_description": "GRAV is a sand box experience where you explore a multitude of planets, hunt strange alien creatures, build and defend outposts, craft weapons and armor, and attempt to survive against other players in a hostile environment."}, {"appid": 288470, "name": "Fable Anniversary", "release_date": "2014-09-12", "developer": "Lionhead Studios", "platforms": "windows", "short_description": "FOR EVERY CHOICE, A CONSEQUENCE.Fully re-mastered with HD visuals and audio, Fable Anniversary is a stunning rendition of the original game that will delight faithful fans and new players alike! The all new Heroic difficulty setting will test the mettle of even the most hardcore Fable fan."}, {"appid": 4770, "name": "Rome: Total War™ - Alexander", "release_date": "2007-08-28", "developer": "The Creative Assembly", "platforms": "windows", "short_description": "Rome: Total War - Alexander is the second official expansion pack to Rome: Total War. An entirely new campaign map that stretches from Macedonia to Greece and into the heart of the ancient Persian Empire New campaign game that tasks players with matching the exploits of Alexander the Great as he swept across Central Asia and dominated..."}, {"appid": 224960, "name": "Tomb Raider I", "release_date": "2012-11-28", "developer": "Core Design", "platforms": "windows", "short_description": "Adventurer Lara Croft has been hired to recover the pieces of an ancient artifact known as the Scion. With her fearless acrobatic style she runs, jumps, swims and climbs her way towards the truth of its origin and powers - leaving only a trail of empty tombs and gun-cartridges in her wake."}, {"appid": 224980, "name": "Tomb Raider IV: The Last Revelation", "release_date": "2012-11-28", "developer": "Core Design", "platforms": "windows", "short_description": "According to Egyptian legend, Horus, son of the light, outwitted the evil God Set and imprisoned him in a secret tomb. Five thousand years later, Lara Croft discovers the lost tomb and unwittingly unleashes the evil God Set, fulfilling the ancient prophecy of his return to plunge mankind into darkness!"}, {"appid": 225000, "name": "Tomb Raider V: Chronicles", "release_date": "2012-11-28", "developer": "Core Design", "platforms": "windows", "short_description": "Lara Croft is missing in Egypt - presumed dead. Those closest to her gather together at the Croft Estate on a grey, rainy day for a memorial service in her honour. Afterwards, the friends sit quietly together in the study of the Croft Mansion and reminisce about Lara's past exploits; exploits that have until now remained a secret.."}, {"appid": 225020, "name": "Tomb Raider VI: The Angel of Darkness", "release_date": "2012-11-28", "developer": "Core Design", "platforms": "windows", "short_description": "A series of grisly murders brings Lara into conflict with a sinister Alchemist from the past, and a secret alliance of powerful individuals shrouded in mystery. Accused of the murder of her one time mentor, Werner Von Croy, Lara becomes a fugitive on the run."}, {"appid": 226840, "name": "Age of Wonders III", "release_date": "2014-03-31", "developer": "Triumph Studios", "platforms": "windows;mac;linux", "short_description": "Age of Wonders III is the long anticipated sequel to the award-winning strategy series. Delivering a unique mix of Empire Building, Role Playing and Warfare, Age of Wonders III offers the ultimate in turn-based fantasy strategy for veterans of the series and new players alike!"}, {"appid": 226860, "name": "Galactic Civilizations III", "release_date": "2015-05-14", "developer": "Stardock Entertainment", "platforms": "windows", "short_description": "Build a civilization that will stand the test of time in the largest space-based strategy game ever! Choose from dozens of unique races and make a name for yourself across the galaxy through diplomacy, espionage, technological advances, and more."}, {"appid": 213650, "name": "Dwarfs - F2P", "release_date": "2012-10-18", "developer": "Power of 2", "platforms": "windows;mac", "short_description": "Dwarfs!? is an addictive, fast paced arcade-like experience, with plenty of difficulty levels and game modes, in the tradition of great games such as “Lemmings” and “Dwarf Fortress”."}, {"appid": 564710, "name": "Soda Dungeon", "release_date": "2017-02-06", "developer": "AN Productions;Poxpower", "platforms": "windows", "short_description": "Pop the top on some legendary action with Soda Dungeon, the fresh and fizzy hit mobile RPG adventure, now available on your desktop! Manage your team as you raid the local dungeons, upgrade your tavern, and attract new party members. Gold, legendary items, and more await you."}, {"appid": 555220, "name": "Detention", "release_date": "2017-01-12", "developer": "RedCandleGames", "platforms": "windows;mac;linux", "short_description": "Detention is an atmospheric horror game set in 1960s Taiwan under martial law. Incorporated religious elements based in Taiwanese/Chinese culture and mythology, the game provided players with unique graphics and gaming experience."}, {"appid": 286100, "name": "You Have to Win the Game", "release_date": "2014-05-06", "developer": "Minor Key Games", "platforms": "windows;mac;linux", "short_description": "You Have to Win the Game is a free exploration platformer with a retro 1980s PC aesthetic."}, {"appid": 228200, "name": "Company of Heroes", "release_date": "2006-09-11", "developer": "Relic Entertainment", "platforms": "windows", "short_description": "Delivering a visceral WWII gaming experience, Company of Heroes redefines RTS by bringing the sacrifice of heroic soldiers, war-ravaged environments, and dynamic battlefields to life. Please visit the &quot;Company of Heroes - Legacy Edition&quot; page for additional user reviews."}, {"appid": 331360, "name": "Heavy Metal Machines", "release_date": "2018-09-19", "developer": "Hoplon", "platforms": "windows", "short_description": "Heavy Metal Machines is a fast-paced FREE TO PLAY Car Battle MOBA that combines unique gameplay on a post-apocalyptic world of Heavy Metal. Join a competitive community, be strategic, drive fast and battle for your life through multiple arenas to become a Legendary Metal Gladiator!"}, {"appid": 228280, "name": "Baldur's Gate: Enhanced Edition", "release_date": "2013-01-16", "developer": "Beamdog", "platforms": "windows;mac;linux", "short_description": "The classic adventure returns! Baldur’s Gate: Enhanced Edition includes the original Baldur’s Gate adventure, the Tales of the Sword Coast expansion, and all-new content including three new party members."}, {"appid": 375230, "name": "Warhammer 40,000: Eternal Crusade", "release_date": "2017-03-16", "developer": "Behaviour Interactive Inc.", "platforms": "windows", "short_description": "Eldar, Orks, Chaos or Space Marines, in the fiercest battles for universal peace, through any means. Try the Free Demo - or buy the Full Premium Game below. We will not give up."}, {"appid": 228300, "name": "Remember Me", "release_date": "2013-06-06", "developer": "DONTNOD Entertainment", "platforms": "windows", "short_description": "Remember Me™ is a 3rd person action adventure where players take on the role of Nilin, a former elite memory hunter with the ability to break into people’s minds and steal or even alter their memories."}, {"appid": 611500, "name": "Quake Champions", "release_date": "2017-08-22", "developer": "id Software", "platforms": "windows", "short_description": "Quake® Champions is a fast-paced Arena shooter, a genre established by the original Quake 20 years ago. Mixing the dark mythos of Quake with the innovative multiplayer of Quake III Arena, the game adds a modern twist – Champions, each with unique attributes and abilities for players to master."}, {"appid": 6920, "name": "Deus Ex: Invisible War", "release_date": "2007-03-29", "developer": "Ion Storm", "platforms": "windows", "short_description": "Approximately 20 years after the events depicted in Deus Ex, The World is only beginning to recover from a Catastrophic worldwide depression. In the Chaotic period of recovery, several religious and political factions see an opportunity to re-shape a worldwide government to their agendas, understanding that the right moves now could..."}, {"appid": 228380, "name": "Wreckfest", "release_date": "2018-06-14", "developer": "Bugbear", "platforms": "windows", "short_description": "Wreckfest is a demolition derby themed racing game with soft-body damage modeling, sophisticated driving dynamics and in-depth vehicle upgrading, featuring both demolition derbies and more traditional track races. It’s all about fun, breakneck racing and over-the-top crashes."}, {"appid": 285330, "name": "RollerCoaster Tycoon® 2: Triple Thrill Pack", "release_date": "2014-05-21", "developer": "Chris Sawyer Productions", "platforms": "windows", "short_description": "This compilation includes the entire RollerCoaster Tycoon 2 series, with the original game as well as the Time Twister and Wacky Worlds expansions."}, {"appid": 285310, "name": "RollerCoaster Tycoon®: Deluxe", "release_date": "2014-05-21", "developer": "Chris Sawyer Productions", "platforms": "windows", "short_description": "RollerCoaster Tycoon Deluxe takes you for a ride in the original RollerCoaster Tycoon and its expansion packs, Corkscrew Follies and Loopy Landscapes. Create the ultimate theme park using a variety of coaster types with giant loops and barrel rolls and in-park attractions like suspended monorails and water-soaked plume rides."}, {"appid": 9160, "name": "Master Levels for Doom II", "release_date": "2007-08-03", "developer": "id Software", "platforms": "windows", "short_description": "Introducing the Master Levels for DOOM II. Twenty never-before-seen levels all with the same acid drenched, hell spawned horror of the originals. Each was created by independent designers and supervised by the demented minds of id Software. You might as well forget about seeing the light of day ever again."}, {"appid": 285190, "name": "Warhammer 40,000: Dawn of War III", "release_date": "2017-04-27", "developer": "Relic Entertainment;Feral Interactive (Mac);Feral Interactive (Linux)", "platforms": "windows;mac;linux", "short_description": "Step into a brutal battle between three warring factions In Dawn of War III you will have no choice but to face your foes when a catastrophic weapon is found on the mysterious world of Acheron."}, {"appid": 9310, "name": "Warhammer® 40,000: Dawn of War® – Winter Assault", "release_date": "2007-08-07", "developer": "Relic Entertainment", "platforms": "windows", "short_description": "This expansion adds all-new units and strategies to the exciting gameplay offered by Dawn of War. The Imperial Guard brings new weaponry, including heavy armor, new troop units as well as defensive and ranged tactics overwhelming numbers. Coupled with new abilities, this fighting force is as lethal as they come."}, {"appid": 554620, "name": "Life is Strange: Before the Storm", "release_date": "2017-08-31", "developer": "Deck Nine;Feral Interactive (Mac);Feral Interactive (Linux)", "platforms": "windows;mac;linux", "short_description": "Life is Strange: Before the Storm is a new three part standalone story adventure set three years before the events of the first game. This time play as Chloe Price, a rebel who forms an unlikely friendship with Rachel Amber in a dramatic new story in the BAFTA award winning franchise."}, {"appid": 209650, "name": "Call of Duty®: Advanced Warfare - Gold Edition", "release_date": "2014-11-03", "developer": "Sledgehammer Games;Raven Software", "platforms": "windows", "short_description": "Call of Duty®: Advanced Warfare envisions a powerful future, where both technology and tactics have evolved to usher in a new era of combat for the franchise.Power Changes Everything."}, {"appid": 8140, "name": "Tomb Raider: Underworld", "release_date": "2008-11-21", "developer": "Crystal Dynamics", "platforms": "windows", "short_description": "Tomb Raider: Underworld represents a new advancement in exploration-based gameplay. As fearless adventurer Lara Croft explore exotic locations around the world, each designed with an incredible attention to detail resulting in breathtaking high-definition visual fidelity that creates a truly believable world and delivers a new level of..."}, {"appid": 8000, "name": "Tomb Raider: Anniversary", "release_date": "2007-06-05", "developer": "Crystal Dynamics;Feral Interactive (Mac)", "platforms": "windows", "short_description": "Tomb Raider: Anniversary retraces Lara Croft's original genre-defining adventure \u0097 globe-trotting 3rd person action-adventure in pursuit of the legendary Scion artifact. Using an enhanced 'Tomb Raider: Legend' game engine, the graphics, technology and physics bring Lara's adventure and pursuit of a mystical artifact known only as the..."}, {"appid": 374040, "name": "Portal Knights", "release_date": "2017-05-18", "developer": "Keen Games", "platforms": "windows", "short_description": "The world of Elysia needs YOU! Join this cooperative, 3D sandbox action RPG to level up your character, craft epic weapons, conquer enemies in real-time, and build almost anything! Craft your adventure. Forge your hero. Become the ultimate Portal Knight!"}, {"appid": 6980, "name": "Thief: Deadly Shadows", "release_date": "2007-03-29", "developer": "Ion Storm", "platforms": "windows", "short_description": "You are Garrett, the master thief. Rarely seen and never caught, Garrett is the best that ever was. Able to sneak past any guard, pick any lock, and break into the most ingeniously secured residences. Garrett steals from the wealthy and gives to himself, making his living in the dark and foreboding City."}, {"appid": 7000, "name": "Tomb Raider: Legend", "release_date": "2007-03-29", "developer": "Crystal Dynamics", "platforms": "windows", "short_description": "Follow Lara Croft down a path of discovery as she travels the globe to remote, exotic locales in search of one of history's greatest artifacts, that unleashes unwelcome figures from Lara's mysterious past."}, {"appid": 480430, "name": "Hide and Shriek", "release_date": "2017-10-19", "developer": "Funcom", "platforms": "windows", "short_description": "Scare or be scared in this FREE adrenaline-pumping multiplayer game full of hijinks and mischief! Set traps, cast spells, and scare the living hell out of your opponent to win!"}, {"appid": 750920, "name": "Shadow of the Tomb Raider", "release_date": "2018-09-14", "developer": "Eidos-Montréal;Crystal Dynamics;Nixxes software", "platforms": "windows", "short_description": "As Lara Croft races to save the world from a Maya apocalypse, she must become the Tomb Raider she is destined to be."}, {"appid": 480490, "name": "Prey", "release_date": "2017-05-04", "developer": "Arkane Studios", "platforms": "windows", "short_description": "In Prey, you awaken aboard Talos I, a space station orbiting the moon in the year 2032. You are the key subject of an experiment meant to alter humanity forever – but things have gone terribly wrong. The space station has been overrun by hostile aliens and you are now being hunted."}, {"appid": 297000, "name": "Heroes® of Might & Magic® III - HD Edition", "release_date": "2015-01-28", "developer": "DotEmu", "platforms": "windows", "short_description": "The most popular Heroes® title of all time is back in HD! Fifteen years later, rediscover the epic tale of Queen Catherine Ironfist, as she re-embarks on her critically acclaimed quest to unite her ravaged homeland and re-conquer the kingdom of Erathia."}, {"appid": 297020, "name": "The Culling Of The Cows", "release_date": "2014-05-09", "developer": "DL Softworks", "platforms": "windows", "short_description": "The Culling Of The Cows is a side-scrolling shooter / tower defence game. You will take the role of Sammy, a soliloquizing schizophrenic farmer with a self prophesied mission to lay waste to the disease spreading over his farm."}, {"appid": 7510, "name": "X-Blades", "release_date": "2009-04-30", "developer": "Gaijin Entertainment", "platforms": "windows;mac;linux", "short_description": "In X-Blades, the player takes on the role of the enchanting heroine Ayumi, who survives a breathtaking dance of blades through the Hordes of Darkness. The long-haired beautiful anime, with her pistol blades and mind-blowing leaps, whirls and swirls from one fantastic level to the next."}, {"appid": 7520, "name": "Two Worlds II HD", "release_date": "2011-02-03", "developer": "Reality Pump Studios", "platforms": "windows;mac", "short_description": "Check out the new Velvet Edition bundle including both Two Worlds II and Pirates of the Flying Fortress DLC."}, {"appid": 7600, "name": "Sid Meier's Railroads!", "release_date": "2007-05-04", "developer": "Firaxis Games;Feral Interactive (Mac)", "platforms": "windows;mac", "short_description": "Sid Meier's Railroads! marks the return of the watershed title in simulation/strategy gaming that launched the popular &quot;tycoon&quot; genre, and inspired a new generation of games. Sid Meier's Railroads!"}, {"appid": 7650, "name": "X-COM: Terror From the Deep", "release_date": "2007-05-04", "developer": "MicroProse Software, Inc", "platforms": "windows", "short_description": "The war continues... X-COM: UFO Defense brought you to a galactic battlefield. X-COM: Terror from the Deep brings the alien terror into a totally new dimension.Seeking to take advantage of a weakened Earth, X-COM's deep space foes unexpectedly change strategy and launch a powerful second front against planet Earth."}, {"appid": 7660, "name": "X-COM: Apocalypse", "release_date": "2008-09-04", "developer": "MicroProse Software, Inc", "platforms": "windows", "short_description": "There's something evil in the city tonight... Earth has been ravaged by human excess, petty conflict and alien invasion. The world's population has been herded into huge cities, the first of which was Mega Primus. 2084: A Utopia shattered, social collapse and civil unrest reigns in Mega Primus. Fiendish aliens terrorize the city."}, {"appid": 7730, "name": "X-COM: Interceptor", "release_date": "2008-09-04", "developer": "MicroProse Software, Inc", "platforms": "windows", "short_description": "They're back...only this time the heinous aliens are out to destroy Earth and rule the new frontier. As X-COM commander, it's your sole duty to protect humanity and the prized mining operations in outer space."}, {"appid": 7770, "name": "X-COM: Enforcer", "release_date": "2008-09-04", "developer": "MicroProse Software, Inc", "platforms": "windows", "short_description": "X-COM: Earth's top-secret eXtraterrestrial COMbat unit The Place: America - early 21st century The Mission: Eradicate the extraterrestrials Alien forces have invaded Earth and are terrorizing the population."}, {"appid": 209830, "name": "Lone Survivor: The Director's Cut", "release_date": "2012-04-23", "developer": "Jasper Byrne", "platforms": "windows;mac", "short_description": "In this original and adult psychological survival horror, the masked protagonist must escape from a city ravaged by disease, by any means necessary."}, {"appid": 213610, "name": "Sonic Adventure 2", "release_date": "2012-11-19", "developer": "SEGA", "platforms": "windows", "short_description": "Experience two unique adventures featuring both long-time heroes and new and returning villains as they battle for the fate of the world!"}, {"appid": 3920, "name": "Sid Meier's Pirates!", "release_date": "2005-07-11", "developer": "Firaxis Games", "platforms": "windows", "short_description": "Sail the Caribbean, marauding all on the high seas or ally your ship and crew as a privateer in search of riches - the life you choose is up to you. Face dogged enemies, raid unsuspecting villages, woo fair maidens, avoid capture or dig for buried treasure. Discover what it takes to become one of the most famous pirates in history!"}, {"appid": 414700, "name": "Outlast 2", "release_date": "2017-04-24", "developer": "Red Barrels", "platforms": "windows", "short_description": "Outlast 2 introduces you to Sullivan Knoth and his followers, who left our wicked world behind to give birth to Temple Gate, a town, deep in the wilderness and hidden from civilization. Knoth and his flock are preparing for the tribulations of the end of times and you’re right in the thick of it."}, {"appid": 2280, "name": "Ultimate Doom", "release_date": "2007-08-03", "developer": "id Software", "platforms": "windows", "short_description": "The complete megahit game that set the world afire. Plus All-New Episode IV: Thy Flesh Consumed. The demons came and the marines died. Except one. You are the last defense against these hell-spawned hordes. Prepare for the most intense mutant-laden, blood-splattered action ever!"}, {"appid": 292120, "name": "FINAL FANTASY® XIII", "release_date": "2014-10-09", "developer": "Square Enix", "platforms": "windows", "short_description": "Final Fantasy XIII is a fantasy RPG in which a band of brave humans struggle against fate in the utopian sky city of Cocoon and the primeval world of Pulse. Follow stylish heroine Lightning's fast paced battles and high adventure in a mysterious new world."}, {"appid": 422100, "name": "Heaven Island Life", "release_date": "2016-04-21", "developer": "Fabio Ferrara", "platforms": "windows", "short_description": "&quot;Heaven Island VIVE&quot; is an experience designed for the HTC Vive in which you'll explore wonderful places. The inspiration for the environments comes from the book &quot;Origins of Architectural Pleasure&quot; in which the welfare is of primary importance. The game requires the HTC Vive device."}, {"appid": 219760, "name": "Beyond Divinity", "release_date": "2012-10-29", "developer": "Larian Studios", "platforms": "windows", "short_description": "Beyond Divinity is the follow-up to the award-winning Divine Divinity."}, {"appid": 219780, "name": "Divinity II: Developer's Cut", "release_date": "2012-10-29", "developer": "Larian Studios", "platforms": "windows", "short_description": "Dragons: they have been hunted, they have been slain, but now the hour to strike back has come."}, {"appid": 217200, "name": "Worms Armageddon", "release_date": "2013-03-19", "developer": "Team17 Digital Ltd", "platforms": "windows", "short_description": "Those intrepid invertebrates return with a vengeance in the much-loved Worms™ Armageddon. It’s a whole new can of worms! It’s hilarious fun that you can enjoy on your own or with all your friends."}, {"appid": 423710, "name": "Invasion: Brain Craving", "release_date": "2016-06-22", "developer": "New Reality Games", "platforms": "windows", "short_description": "It's the zombie-slaying survival game with JRPG elements you didn't know you wanted! Get swarmed by zombies in active-time battles, search for other survivors, eat and most importantly: SURVIVE!"}, {"appid": 220260, "name": "Farming Simulator 2013 Titanium Edition", "release_date": "2013-10-09", "developer": "Giants Software", "platforms": "windows;mac", "short_description": "Animal husbandry, crops, sales… It's up to you to manage and grow your own farm in a huge, totally new world!"}, {"appid": 368360, "name": "60 Seconds!", "release_date": "2015-05-25", "developer": "Robot Gentleman", "platforms": "windows;mac", "short_description": "60 Seconds! is a dark comedy atomic adventure of scavenge and survival. Collect supplies and rescue your family before the nuke hits. Stay alive in your fallout shelter. Make difficult decisions, ration food and hunt mutant cockroaches. And maybe survive. Or not."}, {"appid": 291410, "name": "Duelyst", "release_date": "2016-08-23", "developer": "Counterplay Games Inc.", "platforms": "windows;mac", "short_description": "The depth of CCG meets the strategy of tabletop gaming in Duelyst! Every choice matters, from your General and deck to positioning on the 9x5 battleboard. Competitive head-to-head turn-based battles at its best!"}, {"appid": 2300, "name": "DOOM II", "release_date": "2007-08-03", "developer": "id Software", "platforms": "windows", "short_description": "Let the Obsession begin. Again. This time, the entire forces of the netherworld have overrun Earth. To save her, you must descend into the stygian depths of Hell itself! Battle mightier, nastier, deadlier demons and monsters. Use more powerful weapons."}, {"appid": 648800, "name": "Raft", "release_date": "2018-05-23", "developer": "Redbeet Interactive", "platforms": "windows", "short_description": "Raft throws you and your friends into an epic oceanic adventure! Alone or together, players battle to survive a perilous voyage across a vast sea! Gather debris, scavenge reefs and build your own floating home, but be wary of the man-eating sharks!"}, {"appid": 292730, "name": "Call of Duty®: Infinite Warfare", "release_date": "2016-11-03", "developer": "Infinity Ward", "platforms": "windows", "short_description": "Infinite Warfare delivers three unique game modes: Campaign, Multiplayer, and Zombies."}, {"appid": 368500, "name": "Assassin's Creed® Syndicate", "release_date": "2015-11-18", "developer": "Ubisoft Quebec, in collaboration with Ubisoft Annecy, Bucharest, Kiev, Montreal, Montpellier, Shanghai, Singapore, Sofia, Toronto studios", "platforms": "windows", "short_description": "London, 1868. In the heart of the Industrial Revolution, lead your underworld organization and grow your influence to fight those who exploit the less privileged in the name of..."}, {"appid": 220700, "name": "RPG Maker VX Ace", "release_date": "2012-12-10", "developer": "KADOKAWA", "platforms": "windows", "short_description": "RPG Maker VX Ace improves on every aspect of creating your very own epic adventure. An extremely powerful editor, Ace supports multiple tilesets, offers full control over autoshadow and has a very flexible features system."}, {"appid": 220780, "name": "Thomas Was Alone", "release_date": "2012-11-12", "developer": "Bithell Games", "platforms": "windows;mac", "short_description": "Guide a group of rectangles through a series of obstacles, using their different skills together to get to the end of each environment."}, {"appid": 368730, "name": "No Time To Explain Remastered", "release_date": "2015-07-17", "developer": "tinyBuild", "platforms": "windows;mac;linux", "short_description": "&quot;I Am You From The Future! No Time To Explain, Follow m-OH CHRIST!&quot; Chase your future self through time and alternate realities while fighting giant monsters, collecting hats, and eating cake! No Time To Explain Remastered is the remake of tinyBuild's debut game. Now with multiplayer!"}, {"appid": 217750, "name": "Age of Conan: Unchained", "release_date": "2013-02-22", "developer": "Funcom", "platforms": "windows", "short_description": "Age of Conan: Unchained is an award-winning and critically acclaimed massively multiplayer online game set in the sexy, savage and brutal world of Conan the Barbarian.Tread in the footsteps of the greatest fantasy hero of all time, and explore the vast reaches of Hyboria."}, {"appid": 423230, "name": "Furi", "release_date": "2016-07-05", "developer": "The Game Bakers", "platforms": "windows", "short_description": "The jailer is the key, kill him and you’ll be free."}, {"appid": 293260, "name": "Card Hunter", "release_date": "2015-07-13", "developer": "Blue Manchu", "platforms": "windows;mac", "short_description": "Shuffle your cards and ready your dice - Card Hunter is a fresh new card gaming spin on classic tabletop RPGs. Battle your way through a massive campaign solo or with friends and compete with other players in ranked play and tournaments."}, {"appid": 1530, "name": "Multiwinia", "release_date": "2008-09-19", "developer": "Introversion Software", "platforms": "windows;mac", "short_description": "&quot;Long ago a computer scientist called Dr Sepulveda created a beautiful digital world existing entirely within a computer network of his own invention. This world was called Darwinia and it was inhabited by a peaceful, law-abiding digital life-form called the Darwinians."}, {"appid": 218640, "name": "Lucius", "release_date": "2012-10-26", "developer": "Shiver Games", "platforms": "windows", "short_description": "Equipped with supernatural powers, take control of Lucius as he begins his blood filled tour of horror through his own house."}, {"appid": 334230, "name": "Town of Salem", "release_date": "2014-12-15", "developer": "BlankMediaGames", "platforms": "windows;mac", "short_description": "Inspired by the party games Werewolf and Mafia, Town of Salem is a game of murder, mystery and deception."}, {"appid": 218510, "name": "Planets Under Attack", "release_date": "2012-09-27", "developer": "Targem Games", "platforms": "windows;mac", "short_description": "Play as humans or robots in a brand new sci-fi strategy adventure! Travel into the far reaches of space, through cleverly designed star constellations and variable game modes, conquering enemy planets using 15 combinable technologies."}, {"appid": 292910, "name": "Deponia: The Complete Journey", "release_date": "2014-07-08", "developer": "Daedalic Entertainment", "platforms": "windows;mac;linux", "short_description": "Junk, junk and even more junk. Life on the trash-planet Deponia is anything but a walk in the park. No surprise that Rufus had enough of that and hatches one ludicrous plan after the other to escape this bleak place."}, {"appid": 292410, "name": "Street Racing Syndicate", "release_date": "2014-04-24", "developer": "Eutechnyx", "platforms": "windows", "short_description": "The raw, high-stakes world of illegal street racing comes to life in Street Racing Syndicate. Trick out over 40 authentic licensed cars with parts from over 15 real-world manufacturers, then turn your customized ride loose on the streets of 3 cities across the USA."}, {"appid": 367450, "name": "Poly Bridge", "release_date": "2016-07-12", "developer": "Dry Cactus", "platforms": "windows;mac;linux", "short_description": "Unleash your engineering creativity with an engaging and fresh bridge-building simulator with all the bells and whistles. Enjoy hours of physics-based puzzle solving in the Campaign and then jump in the Sandbox to create your own bridge designs and puzzles!"}, {"appid": 835860, "name": "Dreadnought", "release_date": "2018-10-14", "developer": "Six Foot;YAGER", "platforms": "windows", "short_description": "Command and customize your own capital ships. Take down opponents in thundering, team-based combat. Dreadnought is a free-to-play shooter that puts you at the center of spaceship battles on a colossal scale."}, {"appid": 293180, "name": "Overcast - Walden and the Werewolf", "release_date": "2014-04-18", "developer": "Microblast Games", "platforms": "windows", "short_description": "A mysterious creature has destroyed a village located near Walden's cabin, killing every person residing on the premises. Now, Walden wants revenge. This is the story of an old hunter who has nothing to lose."}, {"appid": 469730, "name": "Super Mega Neo Pug", "release_date": "2016-05-11", "developer": "SnowFlame;Back To Basics Gaming", "platforms": "windows", "short_description": "Turbo Pug is back! and this time, he's airborne! Fly through deserts, green fields and more stunning environments. Dodge an onslaught of enemies and go head to head with giant bosses! Unlock new costumes for Turbo Pug and new creatures to play as. Please try not to squish your pug!"}, {"appid": 218060, "name": "BIT.TRIP Presents... Runner2: Future Legend of Rhythm Alien", "release_date": "2013-02-26", "developer": "Gaijin Games", "platforms": "windows;mac;linux", "short_description": "Runner2 is the sequel to the critically acclaimed and IGF award winning BIT.TRIP RUNNER. In the style of the BIT.TRIP series, Runner2 is a rhythm-music platforming game. Players will run through fantastic environments, using brand new moves, to brand new soundtracks as they run, jump, slide, kick, and soar toward the goal of tracking..."}, {"appid": 1200, "name": "Red Orchestra: Ostfront 41-45", "release_date": "2006-03-14", "developer": "Tripwire Interactive", "platforms": "windows;mac;linux", "short_description": "Fight in the theatre of war that changed the world forever. Battle alongside your compatriots on some of the most inhospitable environments of the Eastern Front in Red Orchestra: Ostfront 41-45. Red Orchestra places you in the most realistic WWII first-person multi-player combat to date on the PC, allowing the player to fight through..."}, {"appid": 334210, "name": "Fortified", "release_date": "2016-02-03", "developer": "Clapfoot", "platforms": "windows", "short_description": "Fortified is an explosive strategy shooter where players will defend the Earth against a menacing Martian invasion in the 1950s. Play as one-of-four pulp inspired heroes as they fight swarms of terrifying robots with an arsenal of Cold War era weapons and experimental technology."}, {"appid": 1500, "name": "Darwinia", "release_date": "2005-07-14", "developer": "Introversion Software", "platforms": "windows;mac;linux", "short_description": "Combining fast-paced action with strategic battle planning, Darwinia features a novel and intuitive control mechanism, a graphical style ripped from 80's retro classics like Tron and Defender, and a story concerning a tribe of nomadic sprites trapped in a modern 3D world."}, {"appid": 1510, "name": "Uplink", "release_date": "2006-08-23", "developer": "Introversion Software", "platforms": "windows;mac;linux", "short_description": "You play an Uplink Agent who makes a living by performing jobs for major corporations. Your tasks involve hacking into rival computer systems, stealing research data, sabotaging other companies, laundering money, erasing evidence, or framing innocent people."}, {"appid": 1520, "name": "DEFCON", "release_date": "2006-09-29", "developer": "Introversion Software", "platforms": "windows;mac;linux", "short_description": "Inspired by the 1983 cult classic film, Wargames, DEFCON superbly evokes the tension, paranoia and suspicion of the Cold War era, playing on the fascinating aspects of psychological gameplay that occur during strategic nuclear warfare. You play a General hidden deep within an underground bunker."}, {"appid": 333600, "name": "NEKOPARA Vol. 1", "release_date": "2014-12-29", "developer": "NEKO WORKs", "platforms": "windows", "short_description": "What's NEKOPARA? Why, it's a cat paradise! Kashou Minaduki, the son of a long line of Japanese confection makers moved out to open his own shop &quot;La Soleil&quot; as a patisserie."}, {"appid": 2500, "name": "Shadowgrounds", "release_date": "2006-05-08", "developer": "Frozenbyte", "platforms": "windows;mac", "short_description": "Shadowgrounds breathes fresh air into the action genre with explosive combat sequences, an innovative weapon upgrade system, and an intriguing storyline. The adrenaline-pumping, top-down gameplay and audiovisual fireworks set the scene for this new action experience which also includes single computer (split keyboard or joystick) co-op..."}, {"appid": 294860, "name": "Valkyria Chronicles™", "release_date": "2014-11-11", "developer": "SEGA", "platforms": "windows", "short_description": "The critically acclaimed Valkyria Chronicles is now available on PC in 1080p True HD, including all previously released DLC!"}, {"appid": 332800, "name": "Five Nights at Freddy's 2", "release_date": "2014-11-10", "developer": "Scott Cawthon", "platforms": "windows", "short_description": "Welcome back to the new and improved Freddy Fazbear's Pizza! As always, Fazbear Entertainment is not responsible for death or dismemberment."}, {"appid": 222940, "name": "THE KING OF FIGHTERS XIII STEAM EDITION", "release_date": "2013-09-13", "developer": "SNK CORPORATION", "platforms": "windows", "short_description": "“THE KING OF FIGHTERS XIII”, SNK PLAYMORE’s flagship 2D versus fighting title returns in an ultimate version on Steam!!The many features exclusive to the console version of the game, such as the ONLINE Mode that allows you to enjoy smooth online versus matches with rivals from around the world, the Tutorial Mode which can be enjoyed by..."}, {"appid": 214770, "name": "Guacamelee! Gold Edition", "release_date": "2013-08-08", "developer": "DrinkBox Studios", "platforms": "windows;mac;linux", "short_description": "Guacamelee! Gold Edition is a Metroidvania-style action-platformer set in a magical Mexican-inspired world. The game draws its inspiration from traditional Mexican culture and folklore, and features many interesting and unique characters."}, {"appid": 613100, "name": "House Flipper", "release_date": "2018-05-17", "developer": "Empyrean", "platforms": "windows;mac", "short_description": "House Flipper is a unique chance to become a one-man renovation crew. Buy, repair and remodel devastated houses. Give them a second life and sell them at a profit!"}, {"appid": 223100, "name": "Homefront®: The Revolution", "release_date": "2016-05-19", "developer": "Dambuster Studios", "platforms": "windows", "short_description": "Homefront®: The Revolution is an open-world first person shooter where you must lead the Resistance movement in guerrilla warfare against a superior military force."}, {"appid": 223220, "name": "Giana Sisters: Twisted Dreams", "release_date": "2012-10-22", "developer": "Black Forest Games", "platforms": "windows", "short_description": "Giana Sisters: Twisted Dreams is a blistering hardcore platformer with contrasting worlds."}, {"appid": 424840, "name": "Little Nightmares", "release_date": "2017-04-27", "developer": "Tarsier Studios", "platforms": "windows", "short_description": "Immerse yourself in Little Nightmares, a dark whimsical tale that will confront you with your childhood fears! Help Six escape The Maw – a vast, mysterious vessel inhabited by corrupted souls looking for their next meal."}, {"appid": 289650, "name": "Assassin's Creed® Unity", "release_date": "2014-12-19", "developer": "Ubisoft", "platforms": "windows", "short_description": "Assassin’s Creed® Unity tells the story of Arno, a young man who embarks upon an extraordinary journey to expose the true powers behind the French Revolution. In the brand new co-op mode, you and your friends will also be thrown in the middle of a ruthless struggle for the fate of a nation."}, {"appid": 612880, "name": "Wolfenstein II: The New Colossus", "release_date": "2017-10-26", "developer": "Machine Games", "platforms": "windows", "short_description": "America, 1961. The assassination of Nazi General Deathshead was a short-lived victory. The Nazis maintain their stranglehold on the world. You are BJ Blazkowicz, aka “Terror-Billy,” member of the Resistance, scourge of the Nazi empire, and humanity’s last hope for liberty."}, {"appid": 2600, "name": "Vampire: The Masquerade - Bloodlines", "release_date": "2007-03-22", "developer": "Troika Games", "platforms": "windows", "short_description": "Vampire®: The Masquerade-Bloodlines™ delivers a new type of RPG experience-one that blends all the core elements of a traditional RPG with the graphical richness, immediacy and brutal combat of a first-person action game. The game plunges players into the dark and gritty vampire underworld of modern-day L.A. as a creature of the night."}, {"appid": 3700, "name": "Sniper Elite", "release_date": "2009-07-16", "developer": "Rebellion", "platforms": "windows", "short_description": "As World War II draws to a close, the first covert battles of the Cold War begin. Caught in the life and death struggle between Soviets and Germans in war-torn Berlin, you control the fate of a lone American OSS Sniper."}, {"appid": 214340, "name": "Deponia", "release_date": "2012-08-06", "developer": "Daedalic Entertainment", "platforms": "windows;mac;linux", "short_description": "In Deponia, the world has degenerated into a vast garbage dump, in which the crotchety Rufus ekes out his sorry existence."}, {"appid": 418460, "name": "Rising Storm 2: Vietnam", "release_date": "2017-05-30", "developer": "Antimatter Games;Tripwire Interactive", "platforms": "windows", "short_description": "Red Orchestra Series' take on Vietnam: 64-player MP matches; 20+ maps; US Army &amp; Marines, PAVN/NVA, NLF/VC; Australians and ARVN forces; 50+ weapons; 4 flyable helicopters; mines, traps and tunnels; Brutal. Authentic. Gritty. Character customization. And napalm in the morning."}, {"appid": 475550, "name": "Beholder", "release_date": "2016-11-09", "developer": "Warm Lamp Games", "platforms": "windows;mac;linux", "short_description": "You’re a State-installed Landlord in a totalitarian State. You must spy on tenants, peep, eavesdrop and profile! You must report on anyone capable of plotting subversion against the State.You MUST! But WILL you?"}, {"appid": 214170, "name": "Divine Divinity", "release_date": "2012-07-05", "developer": "Larian Studios", "platforms": "windows", "short_description": "Divine Divinity is an epic role-playing game with hack-and-slash action, offering a huge world to explore and thousands of items to investigate, trade and use."}, {"appid": 418370, "name": "RESIDENT EVIL 7 biohazard / BIOHAZARD 7 resident evil", "release_date": "2017-01-23", "developer": "CAPCOM Co., Ltd.", "platforms": "windows", "short_description": "Fear and isolation seep through the walls of an abandoned southern farmhouse. &quot;7&quot; marks a new beginning for survival horror with the “Isolated View” of the visceral new first-person perspective."}, {"appid": 213850, "name": "Magic 2014 — Duels of the Planeswalkers", "release_date": "2013-06-26", "developer": "Stainless Games", "platforms": "windows", "short_description": "Ignite your spark with Magic 2014 — Duels of the Planeswalkers! With over 12 million fans, discover what makes Magic: The Gathering the world’s premier trading card game.Become a Planeswalker and travel the planes of existence unleashing a torrent of spells and creatures to devastate your opponents."}, {"appid": 222750, "name": "Wargame: Airland Battle", "release_date": "2013-05-29", "developer": "Eugen Systems", "platforms": "windows;mac;linux", "short_description": "2 SIDES, 12 NATIONS, 750 UNITS: THE STRATEGY GAME REFERENCE IS BACK! Richer, more beautiful and more accessible, Wargame AirLand Battle is the sequel to the explosive real-time strategy game Wargame European Escalation! 1985."}, {"appid": 290300, "name": "Rebel Galaxy", "release_date": "2015-10-20", "developer": "Double Damage Games", "platforms": "windows;mac", "short_description": "Rebel Galaxy is a swashbuckling space adventure, with action-packed combat, exploration, discovery, trade, and “negotiation” with the outlandish denizens at the edge of the known universe."}, {"appid": 214870, "name": "Painkiller Hell & Damnation", "release_date": "2012-10-31", "developer": "The Farm 51", "platforms": "windows;mac;linux", "short_description": "Evil has returned! Demonic powers are manifesting themselves as a myriad of dark creatures, fighting over the fates of imprisoned souls caught in Purgatory."}, {"appid": 290340, "name": "Armello", "release_date": "2015-09-01", "developer": "League of Geeks", "platforms": "windows;mac;linux", "short_description": "Armello is a grim fairy-tale board game come to life, with every match combining deep, tactical card play, rich tabletop strategy and RPG elements. Leverage subterfuge, spells and careful strategy to wrangle control of the game's chaotic odds as you quest for the throne."}, {"appid": 215830, "name": "Closers", "release_date": "2018-02-06", "developer": "Naddic Games", "platforms": "windows", "short_description": "Closers is an episodic anime action RPG bursting with spectacular battles and steeped in an epic storyline. Choose your Closer, gather your friends or dive in solo, and use your amazing powers to protect Earth, in mankind’s desperate battle against horrific monsters from another dimension!"}, {"appid": 221260, "name": "Little Inferno", "release_date": "2012-11-19", "developer": "Tomorrow Corporation", "platforms": "windows;mac;linux", "short_description": "From the designers of World of Goo and Henry Hatsworth. Throw your toys into your fire, and play with them as they burn. Stay warm in there. It's getting cold outside!"}, {"appid": 333420, "name": "Cossacks 3", "release_date": "2016-09-20", "developer": "GSC Game World", "platforms": "windows;linux", "short_description": "Cossacks 3 is a rare combination of war, economy, army developing, building and upgrading that couldn’t be found in any game for the last 15 years. This deep RTS gameplay will return old fans in the golden ages of the genre and give newcomers a unique experience."}, {"appid": 335330, "name": "Brick-Force", "release_date": "2014-12-11", "developer": "Exe Games Inc.", "platforms": "windows", "short_description": "Brick-Force is a sandbox shooter that lets you BUILD your own battlefields, SHARE them with other players, and PLAY many challenging game modes in fast-paced PvP matches!"}, {"appid": 221680, "name": "Rocksmith® 2014 Edition - Remastered", "release_date": "2016-10-04", "developer": "Ubisoft - San Francisco", "platforms": "windows;mac", "short_description": "The fastest way to learn guitar is now better than ever. Join over three million people who have learned to play guitar with the award-winning Rocksmith® method. Plug any real guitar or bass with a 1/4 inch jack directly into your PC or Mac and you’ll learn to play in just 60 days."}, {"appid": 2820, "name": "X3: Terran Conflict", "release_date": "2008-10-16", "developer": "Egosoft", "platforms": "windows;mac;linux", "short_description": "It is the year 2938. The long wished-for encounter of the X Universe and the Earth holds both joy and sorrow for the people. Despite flourishing trade, the clash of the diverse races, cultures and life forms creates new tensions, mistrust and open conflict that need to be overcome!"}, {"appid": 215530, "name": "The Incredible Adventures of Van Helsing", "release_date": "2013-05-22", "developer": "NeocoreGames", "platforms": "windows", "short_description": "Put on your wide-brimmed hat, grab your weapons and embark on an incredible adventure in the gothic-noir world of Borgovia, where mad science threatens the fragile peace between monster and mortal."}, {"appid": 648350, "name": "Jurassic World Evolution", "release_date": "2018-06-11", "developer": "Frontier Developments", "platforms": "windows", "short_description": "Place yourself at the heart of the Jurassic franchise and build your own Jurassic World. Bioengineer dinosaurs that think, feel and react intelligently to the world around them and face threats posed by espionage, breakouts and devastating tropical storms in an uncertain world where life always finds a way."}, {"appid": 518790, "name": "theHunter: Call of the Wild™", "release_date": "2017-02-16", "developer": "Expansive Worlds", "platforms": "windows", "short_description": "Experience the thrill of the hunt in a visually breathtaking, technically groundbreaking, vast open world. Immerse yourself in the atmospheric single player campaign, or share the ultimate hunting experience with friends."}, {"appid": 420290, "name": "Blackwake", "release_date": "2017-02-24", "developer": "Mastfire Studios Pty Ltd", "platforms": "windows;mac", "short_description": "Blackwake is a multiplayer naval FPS focused on teamwork and cooperation. Fire the cannons, sink enemy ships or board them with firearms and steel."}, {"appid": 2990, "name": "FlatOut 2™", "release_date": "2006-12-21", "developer": "Bugbear Entertainment", "platforms": "windows", "short_description": "DRIVING THIS RECKLESS IS NO ACCIDENT! But you might want to cause a few. In these high-speed races, the more damage you inflict, the better. The ultimate in turbo-charged cars and the craziest competitor drivers are waiting to test your best destructive streak. Responsible drivers need not apply."}, {"appid": 222480, "name": "Resident Evil Revelations / Biohazard Revelations", "release_date": "2013-05-23", "developer": "Capcom", "platforms": "windows", "short_description": "Resident Evil® Revelations returns redefined for PC complete with high quality HD visuals, enhanced lighting effects and an immersive sound experience."}, {"appid": 420110, "name": "NEKOPARA Vol. 2", "release_date": "2016-02-19", "developer": "NEKO WORKs", "platforms": "windows", "short_description": "Business is booming for La Soleil, the patisserie run by Kashou Minaduki with his two catgirls, Chocola and Vanilla, his sister Shigure, and the Minaduki family's four catgirl sisters."}, {"appid": 365300, "name": "Transmissions: Element 120", "release_date": "2016-06-16", "developer": "Shokunin;Thomas M. Visser;Vincent Thiele", "platforms": "windows;linux", "short_description": "TE120 is a short single player experience set in the Half-Life Universe featuring a gravity defying weapon that allows you to jump buildings and sustain large falls. The story takes place at a mysterious date &amp; location. Where are you? Why have you been sent?"}, {"appid": 222730, "name": "Reus", "release_date": "2013-05-16", "developer": "Abbey Games", "platforms": "windows;mac;linux", "short_description": "In Reus, you control powerful giants to shape the planet to your will. You can create mountains, oceans, forests and more. Enrich your planet with plants, minerals and animal life. There is only one thing on the planet that you do not control: mankind, with all their virtues and and all their vices."}, {"appid": 375950, "name": "Viridi", "release_date": "2015-08-19", "developer": "Zoe Vartanian;Badru;Isa Hutchinson;Michael Bell", "platforms": "windows;mac;linux", "short_description": "Nurture a small pot of succulents that grow in real time. Viridi is a safe haven, a place you can return to for a moment of peace and quiet whenever you need it."}]